xsession/openocd/svd/microchip/dspic33ep128gm604.svd
<?xml version='1.0' encoding='utf-8'?>
<device schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Microchip</vendor>
  <vendorID>Microchip</vendorID>
  <name>dsPIC33EP128GM604</name>
  <series>dsPIC33EP</series>
  <version>1.0</version>
  <description>Microchip dsPIC33EP128GM604 dsPIC Digital Signal Controller</description>
  <licenseText>Derived from Microchip Device Family Pack data; see metadata.</licenseText>
  <addressUnitBits>8</addressUnitBits>
  <width>16</width>
  <size>16</size>
  <access>read-write</access>
  <resetValue>0x0</resetValue>
  <resetMask>0xffff</resetMask>
  <peripherals>
    <peripheral>
      <name>SFR</name>
      <description>Special Function Register data space</description>
      <groupName>SFR</groupName>
      <baseAddress>0x0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xff4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>INT0Interrupt</name>
        <description>External Interrupt 0</description>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>IC1Interrupt</name>
        <description>Input Compare 1</description>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>OC1Interrupt</name>
        <description>Output Compare 1</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>T1Interrupt</name>
        <description>Timer 1</description>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>DMA0Interrupt</name>
        <description>DMA Channel 0</description>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>IC2Interrupt</name>
        <description>Input Capture 2</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>OC2Interrupt</name>
        <description>Output Compare 2</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>T2Interrupt</name>
        <description>Timer 2</description>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>T3Interrupt</name>
        <description>Timer 3</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>SPI1ErrInterrupt</name>
        <description>SPI1 error</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>U1TXInterrupt</name>
        <description>UART1 Transmitter</description>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>AD1Interrupt</name>
        <description>ADC1 Convert Done</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>DMA1Interrupt</name>
        <description>DMA Channel 1</description>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>SI2C1Interrupt</name>
        <description>I2C1 Slave Events</description>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>MI2C1Interrupt</name>
        <description>I2C1 Master Events</description>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>CM1Interrupt</name>
        <description>Analog Comparator Combined Interrupt</description>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>CNInterrupt</name>
        <description>Change Notification Interrupt</description>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>INT1Interrupt</name>
        <description>External Interrupt 1</description>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>AD2Interrupt</name>
        <description>ADC2 Convert Done</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>IC7Interrupt</name>
        <description>Input Compare 7</description>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>IC8Interrupt</name>
        <description>Input Compare 8</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>DMA2Interrupt</name>
        <description>DMA Channel 2</description>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>OC3Interrupt</name>
        <description>Output Compare 3</description>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>OC4Interrupt</name>
        <description>Output Compare 4</description>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>T4Interrupt</name>
        <description>Timer 4</description>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>T5Interrupt</name>
        <description>Timer 5</description>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>INT2Interrupt</name>
        <description>External Interrupt 2</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>U2RXInterrupt</name>
        <description>UART2 Receiver</description>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>U2TXInterrupt</name>
        <description>UART2 Transmitter</description>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>SPI2ErrInterrupt</name>
        <description>SPI2 error</description>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>SPI2Interrupt</name>
        <description>SPI2 transfer done</description>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>C1RxRdyInterrupt</name>
        <description>ECAN1 Receive Data  Ready</description>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>C1Interrupt</name>
        <description>ECAN1 Event</description>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>DMA3Interrupt</name>
        <description>DMA Channel 3</description>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>IC3Interrupt</name>
        <description>Input Capture 3</description>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>IC4Interrupt</name>
        <description>Input Capture 4</description>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>IC5Interrupt</name>
        <description>Input Capture 5</description>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>IC6Interrupt</name>
        <description>Input Capture 6</description>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>OC5Interrupt</name>
        <description>Output Compare 5</description>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>OC6Interrupt</name>
        <description>Output Compare 6</description>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>OC7Interrupt</name>
        <description>Output Compare 7</description>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>OC8Interrupt</name>
        <description>Output Compare 8</description>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>PMPInterrupt</name>
        <description>PMP Interrupt</description>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>T6Interrupt</name>
        <description>Timer 6</description>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>T7Interrupt</name>
        <description>Timer 7</description>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>SI2C2Interrupt</name>
        <description>I2C2 Slave Events</description>
        <value>49</value>
      </interrupt>
      <interrupt>
        <name>MI2C2Interrupt</name>
        <description>I2C2 Master Events</description>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>T8Interrupt</name>
        <description>Timer 8</description>
        <value>51</value>
      </interrupt>
      <interrupt>
        <name>T9Interrupt</name>
        <description>Timer 9</description>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>INT3Interrupt</name>
        <description>External Interrupt 3</description>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>INT4Interrupt</name>
        <description>External Interrupt 4</description>
        <value>54</value>
      </interrupt>
      <interrupt>
        <name>C2RxRdyInterrupt</name>
        <description>ECAN2 Receive Data  Ready</description>
        <value>55</value>
      </interrupt>
      <interrupt>
        <name>C2Interrupt</name>
        <description>ECAN2 Event</description>
        <value>56</value>
      </interrupt>
      <interrupt>
        <name>PWMSpEventMatchInterrupt</name>
        <description>PWM special event match</description>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>QEI1Interrupt</name>
        <description>QEI1 Position Counter Compare</description>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>DCIEInterrupt</name>
        <description>DCI Fault Interrupt</description>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>DCIInterrupt</name>
        <description>DCI Transfer Done</description>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>RTCCInterrupt</name>
        <description>RTCC Interrupt</description>
        <value>62</value>
      </interrupt>
      <interrupt>
        <name>U1ErrInterrupt</name>
        <description>UART1 Error</description>
        <value>65</value>
      </interrupt>
      <interrupt>
        <name>U2ErrInterrupt</name>
        <description>UART2 Error</description>
        <value>66</value>
      </interrupt>
      <interrupt>
        <name>CRCInterrupt</name>
        <description>CRC Generator Intrrupt</description>
        <value>67</value>
      </interrupt>
      <interrupt>
        <name>C1TxReqInterrupt</name>
        <description>ECAN1 Transmit Data Request</description>
        <value>70</value>
      </interrupt>
      <interrupt>
        <name>C2TxReqInterrupt</name>
        <description>ECAN2 Transmit Data Request</description>
        <value>71</value>
      </interrupt>
      <interrupt>
        <name>PWMSecSpEventMatchInterrupt</name>
        <description>PWM secondary special event match</description>
        <value>73</value>
      </interrupt>
      <interrupt>
        <name>QEI2Interrupt</name>
        <description>QEI2 Position Counter Compare</description>
        <value>75</value>
      </interrupt>
      <interrupt>
        <name>CTMUInterrupt</name>
        <description>CTMU Interrupt</description>
        <value>77</value>
      </interrupt>
      <interrupt>
        <name>U3ErrInterrupt</name>
        <description>UART3 Error</description>
        <value>81</value>
      </interrupt>
      <interrupt>
        <name>U3RXInterrupt</name>
        <description>UART3 Receiver</description>
        <value>82</value>
      </interrupt>
      <interrupt>
        <name>U3TXInterrupt</name>
        <description>UART3 Transmitter</description>
        <value>83</value>
      </interrupt>
      <interrupt>
        <name>U4ErrInterrupt</name>
        <description>UART4 Error</description>
        <value>87</value>
      </interrupt>
      <interrupt>
        <name>U4RXInterrupt</name>
        <description>UART4 Receiver</description>
        <value>88</value>
      </interrupt>
      <interrupt>
        <name>U4TXInterrupt</name>
        <description>UART4 Transmitter</description>
        <value>89</value>
      </interrupt>
      <interrupt>
        <name>SPI3ErrInterrupt</name>
        <description>SPI3 error</description>
        <value>90</value>
      </interrupt>
      <interrupt>
        <name>SPI3Interrupt</name>
        <description>SPI3 transfer done</description>
        <value>91</value>
      </interrupt>
      <interrupt>
        <name>PWM1Interrupt</name>
        <description>PWM1 Interrupt</description>
        <value>94</value>
      </interrupt>
      <interrupt>
        <name>PWM2Interrupt</name>
        <description>PWM2 Interrupt</description>
        <value>95</value>
      </interrupt>
      <interrupt>
        <name>PWM3Interrupt</name>
        <description>PWM3 Interrupt</description>
        <value>96</value>
      </interrupt>
      <interrupt>
        <name>PWM4Interrupt</name>
        <description>PWM4 Interrupt</description>
        <value>97</value>
      </interrupt>
      <interrupt>
        <name>PWM5Interrupt</name>
        <description>PWM5 Interrupt</description>
        <value>98</value>
      </interrupt>
      <interrupt>
        <name>PWM6Interrupt</name>
        <description>PWM6 Interrupt</description>
        <value>99</value>
      </interrupt>
      <interrupt>
        <name>ICDInterrupt</name>
        <description>ICD Application</description>
        <value>142</value>
      </interrupt>
      <interrupt>
        <name>JTAGInterrupt</name>
        <description>JTAG Programming</description>
        <value>143</value>
      </interrupt>
      <interrupt>
        <name>PTGSTEPInterrupt</name>
        <description>PTG Step</description>
        <value>145</value>
      </interrupt>
      <interrupt>
        <name>PTGWDTInterrupt</name>
        <description>PTG Watchdog Timeout</description>
        <value>146</value>
      </interrupt>
      <interrupt>
        <name>PTG0Interrupt</name>
        <description>PTG Interrupt 0</description>
        <value>147</value>
      </interrupt>
      <interrupt>
        <name>PTG1Interrupt</name>
        <description>PTG Interrupt 1</description>
        <value>148</value>
      </interrupt>
      <interrupt>
        <name>PTG2Interrupt</name>
        <description>PTG Interrupt 2</description>
        <value>149</value>
      </interrupt>
      <interrupt>
        <name>PTG3Interrupt</name>
        <description>PTG Interrupt 3</description>
        <value>150</value>
      </interrupt>
      <registers>
        <register>
          <name>WREG0</name>
          <displayName>WREG0</displayName>
          <description>WREG0</description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG0</name>
              <description>WREG0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG1</name>
          <displayName>WREG1</displayName>
          <description>WREG1</description>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG1</name>
              <description>WREG1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG2</name>
          <displayName>WREG2</displayName>
          <description>WREG2</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG2</name>
              <description>WREG2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG3</name>
          <displayName>WREG3</displayName>
          <description>WREG3</description>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG3</name>
              <description>WREG3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG4</name>
          <displayName>WREG4</displayName>
          <description>WREG4</description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG4</name>
              <description>WREG4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG6</name>
          <displayName>WREG6</displayName>
          <description>WREG6</description>
          <addressOffset>0xc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG6</name>
              <description>WREG6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG7</name>
          <displayName>WREG7</displayName>
          <description>WREG7</description>
          <addressOffset>0xe</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG7</name>
              <description>WREG7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG8</name>
          <displayName>WREG8</displayName>
          <description>WREG8</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG8</name>
              <description>WREG8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG9</name>
          <displayName>WREG9</displayName>
          <description>WREG9</description>
          <addressOffset>0x12</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG9</name>
              <description>WREG9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG10</name>
          <displayName>WREG10</displayName>
          <description>WREG10</description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG10</name>
              <description>WREG10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG11</name>
          <displayName>WREG11</displayName>
          <description>WREG11</description>
          <addressOffset>0x16</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG11</name>
              <description>WREG11</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG12</name>
          <displayName>WREG12</displayName>
          <description>WREG12</description>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG12</name>
              <description>WREG12</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG13</name>
          <displayName>WREG13</displayName>
          <description>WREG13</description>
          <addressOffset>0x1a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG13</name>
              <description>WREG13</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG14</name>
          <displayName>WREG14</displayName>
          <description>WREG14</description>
          <addressOffset>0x1c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG14</name>
              <description>WREG14</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG15</name>
          <displayName>WREG15</displayName>
          <description>WREG15</description>
          <addressOffset>0x1e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x80</resetValue>
          <resetMask>0x80</resetMask>
          <fields>
            <field>
              <name>WREG15</name>
              <description>WREG15</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPLIM</name>
          <displayName>SPLIM</displayName>
          <description>SPLIM</description>
          <addressOffset>0x20</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SPLIM</name>
              <description>SPLIM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
