xsession/openocd/svd/microchip/dspic33ep128gm604.svd
        <register>
          <name>ACCAL</name>
          <displayName>ACCAL</displayName>
          <description>ACCAL</description>
          <addressOffset>0x22</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ACCAL</name>
              <description>ACCAL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCAH</name>
          <displayName>ACCAH</displayName>
          <description>ACCAH</description>
          <addressOffset>0x24</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ACCAH</name>
              <description>ACCAH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCAU</name>
          <displayName>ACCAU</displayName>
          <description>ACCAU</description>
          <addressOffset>0x26</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff00</resetMask>
          <fields>
            <field>
              <name>ACCAU</name>
              <description>ACCAU</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCBL</name>
          <displayName>ACCBL</displayName>
          <description>ACCBL</description>
          <addressOffset>0x28</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ACCBL</name>
              <description>ACCBL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCBH</name>
          <displayName>ACCBH</displayName>
          <description>ACCBH</description>
          <addressOffset>0x2a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ACCBH</name>
              <description>ACCBH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCBU</name>
          <displayName>ACCBU</displayName>
          <description>ACCBU</description>
          <addressOffset>0x2c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff00</resetMask>
          <fields>
            <field>
              <name>ACCBU</name>
              <description>ACCBU</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCL</name>
          <displayName>PCL</displayName>
          <description>PCL</description>
          <addressOffset>0x2e</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PCL</name>
              <description>PCL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCH</name>
          <displayName>PCH</displayName>
          <description>PCH</description>
          <addressOffset>0x30</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>PCH</name>
              <description>PCH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DSRPAG</name>
          <displayName>DSRPAG</displayName>
          <description>DSRPAG</description>
          <addressOffset>0x32</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0x3ff</resetMask>
          <fields>
            <field>
              <name>DSRPAG</name>
              <description>DSRPAG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DSWPAG</name>
          <displayName>DSWPAG</displayName>
          <description>DSWPAG</description>
          <addressOffset>0x34</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0x1ff</resetMask>
          <fields>
            <field>
              <name>DSWPAG</name>
              <description>DSWPAG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RCOUNT</name>
          <displayName>RCOUNT</displayName>
          <description>RCOUNT</description>
          <addressOffset>0x36</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RCOUNT</name>
              <description>RCOUNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOUNT</name>
          <displayName>DCOUNT</displayName>
          <description>DCOUNT</description>
          <addressOffset>0x38</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DCOUNT</name>
              <description>DCOUNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DOSTARTL</name>
          <displayName>DOSTARTL</displayName>
          <description>DOSTARTL</description>
          <addressOffset>0x3a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>DOSTARTL</name>
              <description>DOSTARTL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DOSTARTH</name>
          <displayName>DOSTARTH</displayName>
          <description>DOSTARTH</description>
          <addressOffset>0x3c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DOSTARTH</name>
              <description>DOSTARTH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DOENDL</name>
          <displayName>DOENDL</displayName>
          <description>DOENDL</description>
          <addressOffset>0x3e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>DOENDL</name>
              <description>DOENDL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DOENDH</name>
          <displayName>DOENDH</displayName>
          <description>DOENDH</description>
          <addressOffset>0x40</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DOENDH</name>
              <description>DOENDH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>SR</description>
          <addressOffset>0x42</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>C</name>
              <description>C</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CORCON</name>
          <displayName>CORCON</displayName>
          <description>CORCON</description>
          <addressOffset>0x44</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x20</resetValue>
          <resetMask>0xfff</resetMask>
          <fields>
            <field>
              <name>IF</name>
              <description>IF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MODCON</name>
          <displayName>MODCON</displayName>
          <description>MODCON</description>
          <addressOffset>0x46</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xcfff</resetMask>
          <fields>
            <field>
              <name>XWM</name>
              <description>XWM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>XMODSRT</name>
          <displayName>XMODSRT</displayName>
          <description>XMODSRT</description>
          <addressOffset>0x48</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>XS</name>
              <description>XS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>XMODEND</name>
          <displayName>XMODEND</displayName>
          <description>XMODEND</description>
          <addressOffset>0x4a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>XE</name>
              <description>XE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>YMODSRT</name>
          <displayName>YMODSRT</displayName>
          <description>YMODSRT</description>
          <addressOffset>0x4c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>YS</name>
              <description>YS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>YMODEND</name>
          <displayName>YMODEND</displayName>
          <description>YMODEND</description>
          <addressOffset>0x4e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>YE</name>
              <description>YE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>XBREV</name>
          <displayName>XBREV</displayName>
          <description>XBREV</description>
          <addressOffset>0x50</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>XB</name>
              <description>XB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DISICNT</name>
          <displayName>DISICNT</displayName>
          <description>DISICNT</description>
          <addressOffset>0x52</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DISICNT</name>
              <description>DISICNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TBLPAG</name>
          <displayName>TBLPAG</displayName>
          <description>TBLPAG</description>
          <addressOffset>0x54</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TBLPAG</name>
              <description>TBLPAG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MSTRPR</name>
          <displayName>MSTRPR</displayName>
          <description>MSTRPR</description>
          <addressOffset>0x58</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>MSTRPR</name>
              <description>MSTRPR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR1</name>
          <displayName>TMR1</displayName>
          <description>TMR1</description>
          <addressOffset>0x100</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TMR1</name>
              <description>TMR1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PR1</name>
          <displayName>PR1</displayName>
          <description>PR1</description>
          <addressOffset>0x102</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xffff</resetValue>
          <resetMask>0xffff</resetMask>
          <fields>
            <field>
              <name>PR1</name>
              <description>PR1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>T1CON</name>
          <displayName>T1CON</displayName>
          <description>T1CON</description>
          <addressOffset>0x104</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa076</resetMask>
          <fields>
            <field>
              <name>TCS</name>
              <description>TCS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR2</name>
          <displayName>TMR2</displayName>
          <description>TMR2</description>
          <addressOffset>0x106</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TMR2</name>
              <description>TMR2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR3HLD</name>
          <displayName>TMR3HLD</displayName>
          <description>TMR3HLD</description>
          <addressOffset>0x108</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TMR3HLD</name>
              <description>TMR3HLD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR3</name>
          <displayName>TMR3</displayName>
          <description>TMR3</description>
          <addressOffset>0x10a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TMR3</name>
              <description>TMR3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PR2</name>
          <displayName>PR2</displayName>
          <description>PR2</description>
          <addressOffset>0x10c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xffff</resetValue>
          <resetMask>0xffff</resetMask>
          <fields>
            <field>
              <name>PR2</name>
              <description>PR2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PR3</name>
          <displayName>PR3</displayName>
          <description>PR3</description>
          <addressOffset>0x10e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xffff</resetValue>
          <resetMask>0xffff</resetMask>
          <fields>
            <field>
              <name>PR3</name>
              <description>PR3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>T2CON</name>
          <displayName>T2CON</displayName>
          <description>T2CON</description>
          <addressOffset>0x110</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa07a</resetMask>
          <fields>
            <field>
              <name>TCS</name>
              <description>TCS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>T3CON</name>
          <displayName>T3CON</displayName>
          <description>T3CON</description>
          <addressOffset>0x112</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa072</resetMask>
          <fields>
            <field>
              <name>TCS</name>
              <description>TCS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR4</name>
          <displayName>TMR4</displayName>
          <description>TMR4</description>
          <addressOffset>0x114</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TMR4</name>
              <description>TMR4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR5HLD</name>
          <displayName>TMR5HLD</displayName>
          <description>TMR5HLD</description>
          <addressOffset>0x116</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TMR5HLD</name>
              <description>TMR5HLD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR5</name>
          <displayName>TMR5</displayName>
          <description>TMR5</description>
          <addressOffset>0x118</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TMR5</name>
              <description>TMR5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PR4</name>
          <displayName>PR4</displayName>
          <description>PR4</description>
          <addressOffset>0x11a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xffff</resetValue>
          <resetMask>0xffff</resetMask>
          <fields>
            <field>
              <name>PR4</name>
              <description>PR4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
