xsession/openocd/svd/microchip/dspic33ep128gm604.svd
        <register>
          <name>PR5</name>
          <displayName>PR5</displayName>
          <description>PR5</description>
          <addressOffset>0x11c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xffff</resetValue>
          <resetMask>0xffff</resetMask>
          <fields>
            <field>
              <name>PR5</name>
              <description>PR5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>T4CON</name>
          <displayName>T4CON</displayName>
          <description>T4CON</description>
          <addressOffset>0x11e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa07a</resetMask>
          <fields>
            <field>
              <name>TCS</name>
              <description>TCS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>T5CON</name>
          <displayName>T5CON</displayName>
          <description>T5CON</description>
          <addressOffset>0x120</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa072</resetMask>
          <fields>
            <field>
              <name>TCS</name>
              <description>TCS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR6</name>
          <displayName>TMR6</displayName>
          <description>TMR6</description>
          <addressOffset>0x122</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TMR6</name>
              <description>TMR6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR7HLD</name>
          <displayName>TMR7HLD</displayName>
          <description>TMR7HLD</description>
          <addressOffset>0x124</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TMR7HLD</name>
              <description>TMR7HLD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR7</name>
          <displayName>TMR7</displayName>
          <description>TMR7</description>
          <addressOffset>0x126</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TMR7</name>
              <description>TMR7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PR6</name>
          <displayName>PR6</displayName>
          <description>PR6</description>
          <addressOffset>0x128</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xffff</resetValue>
          <resetMask>0xffff</resetMask>
          <fields>
            <field>
              <name>PR6</name>
              <description>PR6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PR7</name>
          <displayName>PR7</displayName>
          <description>PR7</description>
          <addressOffset>0x12a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xffff</resetValue>
          <resetMask>0xffff</resetMask>
          <fields>
            <field>
              <name>PR7</name>
              <description>PR7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>T6CON</name>
          <displayName>T6CON</displayName>
          <description>T6CON</description>
          <addressOffset>0x12c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa07a</resetMask>
          <fields>
            <field>
              <name>TCS</name>
              <description>TCS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>T7CON</name>
          <displayName>T7CON</displayName>
          <description>T7CON</description>
          <addressOffset>0x12e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa072</resetMask>
          <fields>
            <field>
              <name>TCS</name>
              <description>TCS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR8</name>
          <displayName>TMR8</displayName>
          <description>TMR8</description>
          <addressOffset>0x130</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TMR8</name>
              <description>TMR8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR9HLD</name>
          <displayName>TMR9HLD</displayName>
          <description>TMR9HLD</description>
          <addressOffset>0x132</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TMR9HLD</name>
              <description>TMR9HLD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR9</name>
          <displayName>TMR9</displayName>
          <description>TMR9</description>
          <addressOffset>0x134</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TMR9</name>
              <description>TMR9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PR8</name>
          <displayName>PR8</displayName>
          <description>PR8</description>
          <addressOffset>0x136</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xffff</resetValue>
          <resetMask>0xffff</resetMask>
          <fields>
            <field>
              <name>PR8</name>
              <description>PR8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PR9</name>
          <displayName>PR9</displayName>
          <description>PR9</description>
          <addressOffset>0x138</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xffff</resetValue>
          <resetMask>0xffff</resetMask>
          <fields>
            <field>
              <name>PR9</name>
              <description>PR9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>T8CON</name>
          <displayName>T8CON</displayName>
          <description>T8CON</description>
          <addressOffset>0x13a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa07a</resetMask>
          <fields>
            <field>
              <name>TCS</name>
              <description>TCS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>T9CON</name>
          <displayName>T9CON</displayName>
          <description>T9CON</description>
          <addressOffset>0x13c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa072</resetMask>
          <fields>
            <field>
              <name>TCS</name>
              <description>TCS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC1CON1</name>
          <displayName>IC1CON1</displayName>
          <description>IC1CON1</description>
          <addressOffset>0x140</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3c7f</resetMask>
          <fields>
            <field>
              <name>ICM</name>
              <description>ICM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC1CON2</name>
          <displayName>IC1CON2</displayName>
          <description>IC1CON2</description>
          <addressOffset>0x142</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xd</resetValue>
          <resetMask>0x1df</resetMask>
          <fields>
            <field>
              <name>SYNCSEL</name>
              <description>SYNCSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC1BUF</name>
          <displayName>IC1BUF</displayName>
          <description>IC1BUF</description>
          <addressOffset>0x144</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>IC1BUF</name>
              <description>IC1BUF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC1TMR</name>
          <displayName>IC1TMR</displayName>
          <description>IC1TMR</description>
          <addressOffset>0x146</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>IC1TMR</name>
              <description>IC1TMR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC2CON1</name>
          <displayName>IC2CON1</displayName>
          <description>IC2CON1</description>
          <addressOffset>0x148</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3c7f</resetMask>
          <fields>
            <field>
              <name>ICM</name>
              <description>ICM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC2CON2</name>
          <displayName>IC2CON2</displayName>
          <description>IC2CON2</description>
          <addressOffset>0x14a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xd</resetValue>
          <resetMask>0x1df</resetMask>
          <fields>
            <field>
              <name>SYNCSEL</name>
              <description>SYNCSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC2BUF</name>
          <displayName>IC2BUF</displayName>
          <description>IC2BUF</description>
          <addressOffset>0x14c</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>IC2BUF</name>
              <description>IC2BUF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC2TMR</name>
          <displayName>IC2TMR</displayName>
          <description>IC2TMR</description>
          <addressOffset>0x14e</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>IC2TMR</name>
              <description>IC2TMR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC3CON1</name>
          <displayName>IC3CON1</displayName>
          <description>IC3CON1</description>
          <addressOffset>0x150</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3c7f</resetMask>
          <fields>
            <field>
              <name>ICM</name>
              <description>ICM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC3CON2</name>
          <displayName>IC3CON2</displayName>
          <description>IC3CON2</description>
          <addressOffset>0x152</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xd</resetValue>
          <resetMask>0x1df</resetMask>
          <fields>
            <field>
              <name>SYNCSEL</name>
              <description>SYNCSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC3BUF</name>
          <displayName>IC3BUF</displayName>
          <description>IC3BUF</description>
          <addressOffset>0x154</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>IC3BUF</name>
              <description>IC3BUF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC3TMR</name>
          <displayName>IC3TMR</displayName>
          <description>IC3TMR</description>
          <addressOffset>0x156</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>IC3TMR</name>
              <description>IC3TMR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC4CON1</name>
          <displayName>IC4CON1</displayName>
          <description>IC4CON1</description>
          <addressOffset>0x158</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3c7f</resetMask>
          <fields>
            <field>
              <name>ICM</name>
              <description>ICM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC4CON2</name>
          <displayName>IC4CON2</displayName>
          <description>IC4CON2</description>
          <addressOffset>0x15a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xd</resetValue>
          <resetMask>0x1df</resetMask>
          <fields>
            <field>
              <name>SYNCSEL</name>
              <description>SYNCSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC4BUF</name>
          <displayName>IC4BUF</displayName>
          <description>IC4BUF</description>
          <addressOffset>0x15c</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>IC4BUF</name>
              <description>IC4BUF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC4TMR</name>
          <displayName>IC4TMR</displayName>
          <description>IC4TMR</description>
          <addressOffset>0x15e</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>IC4TMR</name>
              <description>IC4TMR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC5CON1</name>
          <displayName>IC5CON1</displayName>
          <description>IC5CON1</description>
          <addressOffset>0x160</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3c7f</resetMask>
          <fields>
            <field>
              <name>ICM</name>
              <description>ICM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC5CON2</name>
          <displayName>IC5CON2</displayName>
          <description>IC5CON2</description>
          <addressOffset>0x162</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xd</resetValue>
          <resetMask>0x1df</resetMask>
          <fields>
            <field>
              <name>SYNCSEL</name>
              <description>SYNCSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC5BUF</name>
          <displayName>IC5BUF</displayName>
          <description>IC5BUF</description>
          <addressOffset>0x164</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>IC5BUF</name>
              <description>IC5BUF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC5TMR</name>
          <displayName>IC5TMR</displayName>
          <description>IC5TMR</description>
          <addressOffset>0x166</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>IC5TMR</name>
              <description>IC5TMR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC6CON1</name>
          <displayName>IC6CON1</displayName>
          <description>IC6CON1</description>
          <addressOffset>0x168</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3c7f</resetMask>
          <fields>
            <field>
              <name>ICM</name>
              <description>ICM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC6CON2</name>
          <displayName>IC6CON2</displayName>
          <description>IC6CON2</description>
          <addressOffset>0x16a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xd</resetValue>
          <resetMask>0x1df</resetMask>
          <fields>
            <field>
              <name>SYNCSEL</name>
              <description>SYNCSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC6BUF</name>
          <displayName>IC6BUF</displayName>
          <description>IC6BUF</description>
          <addressOffset>0x16c</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>IC6BUF</name>
              <description>IC6BUF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC6TMR</name>
          <displayName>IC6TMR</displayName>
          <description>IC6TMR</description>
          <addressOffset>0x16e</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>IC6TMR</name>
              <description>IC6TMR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
