xsession/openocd/svd/microchip/dspic33ep128gm604.svd
        <register>
          <name>IC7CON1</name>
          <displayName>IC7CON1</displayName>
          <description>IC7CON1</description>
          <addressOffset>0x170</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3c7f</resetMask>
          <fields>
            <field>
              <name>ICM</name>
              <description>ICM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC7CON2</name>
          <displayName>IC7CON2</displayName>
          <description>IC7CON2</description>
          <addressOffset>0x172</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xd</resetValue>
          <resetMask>0x1df</resetMask>
          <fields>
            <field>
              <name>SYNCSEL</name>
              <description>SYNCSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC7BUF</name>
          <displayName>IC7BUF</displayName>
          <description>IC7BUF</description>
          <addressOffset>0x174</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>IC7BUF</name>
              <description>IC7BUF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC7TMR</name>
          <displayName>IC7TMR</displayName>
          <description>IC7TMR</description>
          <addressOffset>0x176</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>IC7TMR</name>
              <description>IC7TMR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC8CON1</name>
          <displayName>IC8CON1</displayName>
          <description>IC8CON1</description>
          <addressOffset>0x178</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3c7f</resetMask>
          <fields>
            <field>
              <name>ICM</name>
              <description>ICM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC8CON2</name>
          <displayName>IC8CON2</displayName>
          <description>IC8CON2</description>
          <addressOffset>0x17a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xd</resetValue>
          <resetMask>0x1df</resetMask>
          <fields>
            <field>
              <name>SYNCSEL</name>
              <description>SYNCSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC8BUF</name>
          <displayName>IC8BUF</displayName>
          <description>IC8BUF</description>
          <addressOffset>0x17c</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>IC8BUF</name>
              <description>IC8BUF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC8TMR</name>
          <displayName>IC8TMR</displayName>
          <description>IC8TMR</description>
          <addressOffset>0x17e</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>IC8TMR</name>
              <description>IC8TMR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>QEI1CON</name>
          <displayName>QEI1CON</displayName>
          <description>QEI1CON</description>
          <addressOffset>0x1c0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>CCM</name>
              <description>CCM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>QEI1IOC</name>
          <displayName>QEI1IOC</displayName>
          <description>QEI1IOC</description>
          <addressOffset>0x1c2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>QEA</name>
              <description>QEA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>QEI1STAT</name>
          <displayName>QEI1STAT</displayName>
          <description>QEI1STAT</description>
          <addressOffset>0x1c4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>IDXIEN</name>
              <description>IDXIEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>POS1CNTL</name>
          <displayName>POS1CNTL</displayName>
          <description>POS1CNTL</description>
          <addressOffset>0x1c6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>POSCNTL</name>
              <description>POSCNTL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>POS1CNTH</name>
          <displayName>POS1CNTH</displayName>
          <description>POS1CNTH</description>
          <addressOffset>0x1c8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>POSCNTH</name>
              <description>POSCNTH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>POS1HLD</name>
          <displayName>POS1HLD</displayName>
          <description>POS1HLD</description>
          <addressOffset>0x1ca</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>POSHLD</name>
              <description>POSHLD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VEL1CNT</name>
          <displayName>VEL1CNT</displayName>
          <description>VEL1CNT</description>
          <addressOffset>0x1cc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>VELCNT</name>
              <description>VELCNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INT1TMRL</name>
          <displayName>INT1TMRL</displayName>
          <description>INT1TMRL</description>
          <addressOffset>0x1ce</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>INTTMRL</name>
              <description>INTTMRL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INT1TMRH</name>
          <displayName>INT1TMRH</displayName>
          <description>INT1TMRH</description>
          <addressOffset>0x1d0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>INTTMRH</name>
              <description>INTTMRH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INT1HLDL</name>
          <displayName>INT1HLDL</displayName>
          <description>INT1HLDL</description>
          <addressOffset>0x1d2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>INTHLDL</name>
              <description>INTHLDL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INT1HLDH</name>
          <displayName>INT1HLDH</displayName>
          <description>INT1HLDH</description>
          <addressOffset>0x1d4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>INTHLDH</name>
              <description>INTHLDH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INDX1CNTL</name>
          <displayName>INDX1CNTL</displayName>
          <description>INDX1CNTL</description>
          <addressOffset>0x1d6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>INDXCNTL</name>
              <description>INDXCNTL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INDX1CNTH</name>
          <displayName>INDX1CNTH</displayName>
          <description>INDX1CNTH</description>
          <addressOffset>0x1d8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>INDXCNTH</name>
              <description>INDXCNTH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INDX1HLD</name>
          <displayName>INDX1HLD</displayName>
          <description>INDX1HLD</description>
          <addressOffset>0x1da</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>INDXHLD</name>
              <description>INDXHLD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>QEI1GECL</name>
          <displayName>QEI1GECL</displayName>
          <description>QEI1GECL</description>
          <addressOffset>0x1dc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>QEIGEC</name>
              <description>QEIGEC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>QEI1GECH</name>
          <displayName>QEI1GECH</displayName>
          <description>QEI1GECH</description>
          <addressOffset>0x1de</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>QEIGEC</name>
              <description>QEIGEC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>QEI1LECL</name>
          <displayName>QEI1LECL</displayName>
          <description>QEI1LECL</description>
          <addressOffset>0x1e0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>QEILEC</name>
              <description>QEILEC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>QEI1LECH</name>
          <displayName>QEI1LECH</displayName>
          <description>QEI1LECH</description>
          <addressOffset>0x1e2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>QEILEC</name>
              <description>QEILEC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C1RCV</name>
          <displayName>I2C1RCV</displayName>
          <description>I2C1RCV</description>
          <addressOffset>0x200</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>I2CRCV</name>
              <description>I2CRCV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C1TRN</name>
          <displayName>I2C1TRN</displayName>
          <description>I2C1TRN</description>
          <addressOffset>0x202</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0xff</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>I2CTRN</name>
              <description>I2CTRN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C1BRG</name>
          <displayName>I2C1BRG</displayName>
          <description>I2C1BRG</description>
          <addressOffset>0x204</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ff</resetMask>
          <fields>
            <field>
              <name>I2CBRG</name>
              <description>I2CBRG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C1CON</name>
          <displayName>I2C1CON</displayName>
          <description>I2C1CON</description>
          <addressOffset>0x206</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1000</resetValue>
          <resetMask>0xbfff</resetMask>
          <fields>
            <field>
              <name>SEN</name>
              <description>SEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C1STAT</name>
          <displayName>I2C1STAT</displayName>
          <description>I2C1STAT</description>
          <addressOffset>0x208</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xc7ff</resetMask>
          <fields>
            <field>
              <name>TBF</name>
              <description>TBF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C1ADD</name>
          <displayName>I2C1ADD</displayName>
          <description>I2C1ADD</description>
          <addressOffset>0x20a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3ff</resetMask>
          <fields>
            <field>
              <name>I2CADD</name>
              <description>I2CADD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C1MSK</name>
          <displayName>I2C1MSK</displayName>
          <description>I2C1MSK</description>
          <addressOffset>0x20c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3ff</resetMask>
          <fields>
            <field>
              <name>AMSK</name>
              <description>AMSK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C2RCV</name>
          <displayName>I2C2RCV</displayName>
          <description>I2C2RCV</description>
          <addressOffset>0x210</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>I2CRCV</name>
              <description>I2CRCV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C2TRN</name>
          <displayName>I2C2TRN</displayName>
          <description>I2C2TRN</description>
          <addressOffset>0x212</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0xff</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>I2CTRN</name>
              <description>I2CTRN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C2BRG</name>
          <displayName>I2C2BRG</displayName>
          <description>I2C2BRG</description>
          <addressOffset>0x214</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ff</resetMask>
          <fields>
            <field>
              <name>I2CBRG</name>
              <description>I2CBRG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C2CON</name>
          <displayName>I2C2CON</displayName>
          <description>I2C2CON</description>
          <addressOffset>0x216</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1000</resetValue>
          <resetMask>0xbfff</resetMask>
          <fields>
            <field>
              <name>SEN</name>
              <description>SEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C2STAT</name>
          <displayName>I2C2STAT</displayName>
          <description>I2C2STAT</description>
          <addressOffset>0x218</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xc7ff</resetMask>
          <fields>
            <field>
              <name>TBF</name>
              <description>TBF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C2ADD</name>
          <displayName>I2C2ADD</displayName>
          <description>I2C2ADD</description>
          <addressOffset>0x21a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3ff</resetMask>
          <fields>
            <field>
              <name>I2CADD</name>
              <description>I2CADD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C2MSK</name>
          <displayName>I2C2MSK</displayName>
          <description>I2C2MSK</description>
          <addressOffset>0x21c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3ff</resetMask>
          <fields>
            <field>
              <name>AMSK</name>
              <description>AMSK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
