xsession/openocd/svd/microchip/dspic33ep128gm604.svd
        <register>
          <name>U1MODE</name>
          <displayName>U1MODE</displayName>
          <description>U1MODE</description>
          <addressOffset>0x220</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xbbff</resetMask>
          <fields>
            <field>
              <name>STSEL</name>
              <description>STSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U1STA</name>
          <displayName>U1STA</displayName>
          <description>U1STA</description>
          <addressOffset>0x222</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x110</resetValue>
          <resetMask>0xefff</resetMask>
          <fields>
            <field>
              <name>URXDA</name>
              <description>URXDA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U1TXREG</name>
          <displayName>U1TXREG</displayName>
          <description>U1TXREG</description>
          <addressOffset>0x224</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>U1TXREG</name>
              <description>U1TXREG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U1RXREG</name>
          <displayName>U1RXREG</displayName>
          <description>U1RXREG</description>
          <addressOffset>0x226</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ff</resetMask>
          <fields>
            <field>
              <name>U1RXREG</name>
              <description>U1RXREG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U1BRG</name>
          <displayName>U1BRG</displayName>
          <description>U1BRG</description>
          <addressOffset>0x228</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>BRG</name>
              <description>BRG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U2MODE</name>
          <displayName>U2MODE</displayName>
          <description>U2MODE</description>
          <addressOffset>0x230</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xbbff</resetMask>
          <fields>
            <field>
              <name>STSEL</name>
              <description>STSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U2STA</name>
          <displayName>U2STA</displayName>
          <description>U2STA</description>
          <addressOffset>0x232</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x110</resetValue>
          <resetMask>0xefff</resetMask>
          <fields>
            <field>
              <name>URXDA</name>
              <description>URXDA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U2TXREG</name>
          <displayName>U2TXREG</displayName>
          <description>U2TXREG</description>
          <addressOffset>0x234</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>U2TXREG</name>
              <description>U2TXREG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U2RXREG</name>
          <displayName>U2RXREG</displayName>
          <description>U2RXREG</description>
          <addressOffset>0x236</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ff</resetMask>
          <fields>
            <field>
              <name>U2RXREG</name>
              <description>U2RXREG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U2BRG</name>
          <displayName>U2BRG</displayName>
          <description>U2BRG</description>
          <addressOffset>0x238</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>BRG</name>
              <description>BRG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI1STAT</name>
          <displayName>SPI1STAT</displayName>
          <description>SPI1STAT</description>
          <addressOffset>0x240</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa7ff</resetMask>
          <fields>
            <field>
              <name>SPIRBF</name>
              <description>SPIRBF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI1CON1</name>
          <displayName>SPI1CON1</displayName>
          <description>SPI1CON1</description>
          <addressOffset>0x242</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1fff</resetMask>
          <fields>
            <field>
              <name>PPRE</name>
              <description>PPRE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI1CON2</name>
          <displayName>SPI1CON2</displayName>
          <description>SPI1CON2</description>
          <addressOffset>0x244</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xe003</resetMask>
          <fields>
            <field>
              <name>SPIBEN</name>
              <description>SPIBEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI1BUF</name>
          <displayName>SPI1BUF</displayName>
          <description>SPI1BUF</description>
          <addressOffset>0x248</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SPI1BUF</name>
              <description>SPI1BUF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U3MODE</name>
          <displayName>U3MODE</displayName>
          <description>U3MODE</description>
          <addressOffset>0x250</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xbbff</resetMask>
          <fields>
            <field>
              <name>STSEL</name>
              <description>STSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U3STA</name>
          <displayName>U3STA</displayName>
          <description>U3STA</description>
          <addressOffset>0x252</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x110</resetValue>
          <resetMask>0xefff</resetMask>
          <fields>
            <field>
              <name>URXDA</name>
              <description>URXDA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U3TXREG</name>
          <displayName>U3TXREG</displayName>
          <description>U3TXREG</description>
          <addressOffset>0x254</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>U3TXREG</name>
              <description>U3TXREG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U3RXREG</name>
          <displayName>U3RXREG</displayName>
          <description>U3RXREG</description>
          <addressOffset>0x256</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ff</resetMask>
          <fields>
            <field>
              <name>U3RXREG</name>
              <description>U3RXREG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U3BRG</name>
          <displayName>U3BRG</displayName>
          <description>U3BRG</description>
          <addressOffset>0x258</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>BRG</name>
              <description>BRG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2STAT</name>
          <displayName>SPI2STAT</displayName>
          <description>SPI2STAT</description>
          <addressOffset>0x260</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa7ff</resetMask>
          <fields>
            <field>
              <name>SPIRBF</name>
              <description>SPIRBF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2CON1</name>
          <displayName>SPI2CON1</displayName>
          <description>SPI2CON1</description>
          <addressOffset>0x262</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1fff</resetMask>
          <fields>
            <field>
              <name>PPRE</name>
              <description>PPRE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2CON2</name>
          <displayName>SPI2CON2</displayName>
          <description>SPI2CON2</description>
          <addressOffset>0x264</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xe003</resetMask>
          <fields>
            <field>
              <name>SPIBEN</name>
              <description>SPIBEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2BUF</name>
          <displayName>SPI2BUF</displayName>
          <description>SPI2BUF</description>
          <addressOffset>0x268</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SPI2BUF</name>
              <description>SPI2BUF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DCICON1</name>
          <displayName>DCICON1</displayName>
          <description>DCICON1</description>
          <addressOffset>0x280</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xafe3</resetMask>
          <fields>
            <field>
              <name>COFSM</name>
              <description>COFSM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DCICON2</name>
          <displayName>DCICON2</displayName>
          <description>DCICON2</description>
          <addressOffset>0x282</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xdef</resetMask>
          <fields>
            <field>
              <name>WS</name>
              <description>WS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DCICON3</name>
          <displayName>DCICON3</displayName>
          <description>DCICON3</description>
          <addressOffset>0x284</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xfff</resetMask>
          <fields>
            <field>
              <name>BCG</name>
              <description>BCG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DCISTAT</name>
          <displayName>DCISTAT</displayName>
          <description>DCISTAT</description>
          <addressOffset>0x286</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf0f</resetMask>
          <fields>
            <field>
              <name>TMPTY</name>
              <description>TMPTY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSCON</name>
          <displayName>TSCON</displayName>
          <description>TSCON</description>
          <addressOffset>0x288</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TSE0</name>
              <description>TSE0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RESERVED1</name>
          <displayName>RESERVED1</displayName>
          <description>RESERVED1</description>
          <addressOffset>0x28a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <register>
          <name>RSCON</name>
          <displayName>RSCON</displayName>
          <description>RSCON</description>
          <addressOffset>0x28c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RSE0</name>
              <description>RSE0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RESERVED2</name>
          <displayName>RESERVED2</displayName>
          <description>RESERVED2</description>
          <addressOffset>0x28e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <register>
          <name>RXBUF0</name>
          <displayName>RXBUF0</displayName>
          <description>RXBUF0</description>
          <addressOffset>0x290</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RXBUF0</name>
              <description>RXBUF0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RXBUF1</name>
          <displayName>RXBUF1</displayName>
          <description>RXBUF1</description>
          <addressOffset>0x292</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RXBUF1</name>
              <description>RXBUF1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RXBUF2</name>
          <displayName>RXBUF2</displayName>
          <description>RXBUF2</description>
          <addressOffset>0x294</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RXBUF2</name>
              <description>RXBUF2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RXBUF3</name>
          <displayName>RXBUF3</displayName>
          <description>RXBUF3</description>
          <addressOffset>0x296</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RXBUF3</name>
              <description>RXBUF3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBUF0</name>
          <displayName>TXBUF0</displayName>
          <description>TXBUF0</description>
          <addressOffset>0x298</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TXBUF0</name>
              <description>TXBUF0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBUF1</name>
          <displayName>TXBUF1</displayName>
          <description>TXBUF1</description>
          <addressOffset>0x29a</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TXBUF1</name>
              <description>TXBUF1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBUF2</name>
          <displayName>TXBUF2</displayName>
          <description>TXBUF2</description>
          <addressOffset>0x29c</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TXBUF2</name>
              <description>TXBUF2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBUF3</name>
          <displayName>TXBUF3</displayName>
          <description>TXBUF3</description>
          <addressOffset>0x29e</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TXBUF3</name>
              <description>TXBUF3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI3STAT</name>
          <displayName>SPI3STAT</displayName>
          <description>SPI3STAT</description>
          <addressOffset>0x2a0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa7ff</resetMask>
          <fields>
            <field>
              <name>SPIRBF</name>
              <description>SPIRBF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI3CON1</name>
          <displayName>SPI3CON1</displayName>
          <description>SPI3CON1</description>
          <addressOffset>0x2a2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1fff</resetMask>
          <fields>
            <field>
              <name>PPRE</name>
              <description>PPRE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
