xsession/openocd/svd/microchip/dspic33ep128gm604.svd
        <register>
          <name>SPI3CON2</name>
          <displayName>SPI3CON2</displayName>
          <description>SPI3CON2</description>
          <addressOffset>0x2a4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xe003</resetMask>
          <fields>
            <field>
              <name>SPIBEN</name>
              <description>SPIBEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI3BUF</name>
          <displayName>SPI3BUF</displayName>
          <description>SPI3BUF</description>
          <addressOffset>0x2a8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SPI3BUF</name>
              <description>SPI3BUF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U4MODE</name>
          <displayName>U4MODE</displayName>
          <description>U4MODE</description>
          <addressOffset>0x2b0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xbbff</resetMask>
          <fields>
            <field>
              <name>STSEL</name>
              <description>STSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U4STA</name>
          <displayName>U4STA</displayName>
          <description>U4STA</description>
          <addressOffset>0x2b2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x110</resetValue>
          <resetMask>0xefff</resetMask>
          <fields>
            <field>
              <name>URXDA</name>
              <description>URXDA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U4TXREG</name>
          <displayName>U4TXREG</displayName>
          <description>U4TXREG</description>
          <addressOffset>0x2b4</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>U4TXREG</name>
              <description>U4TXREG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U4RXREG</name>
          <displayName>U4RXREG</displayName>
          <description>U4RXREG</description>
          <addressOffset>0x2b6</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ff</resetMask>
          <fields>
            <field>
              <name>U4RXREG</name>
              <description>U4RXREG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U4BRG</name>
          <displayName>U4BRG</displayName>
          <description>U4BRG</description>
          <addressOffset>0x2b8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>BRG</name>
              <description>BRG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF0</name>
          <displayName>ADC1BUF0</displayName>
          <description>ADC1BUF0</description>
          <addressOffset>0x300</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC1BUF0</name>
              <description>ADC1BUF0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF1</name>
          <displayName>ADC1BUF1</displayName>
          <description>ADC1BUF1</description>
          <addressOffset>0x302</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC1BUF1</name>
              <description>ADC1BUF1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF2</name>
          <displayName>ADC1BUF2</displayName>
          <description>ADC1BUF2</description>
          <addressOffset>0x304</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC1BUF2</name>
              <description>ADC1BUF2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF3</name>
          <displayName>ADC1BUF3</displayName>
          <description>ADC1BUF3</description>
          <addressOffset>0x306</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC1BUF3</name>
              <description>ADC1BUF3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF4</name>
          <displayName>ADC1BUF4</displayName>
          <description>ADC1BUF4</description>
          <addressOffset>0x308</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC1BUF4</name>
              <description>ADC1BUF4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF5</name>
          <displayName>ADC1BUF5</displayName>
          <description>ADC1BUF5</description>
          <addressOffset>0x30a</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC1BUF5</name>
              <description>ADC1BUF5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF6</name>
          <displayName>ADC1BUF6</displayName>
          <description>ADC1BUF6</description>
          <addressOffset>0x30c</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC1BUF6</name>
              <description>ADC1BUF6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF7</name>
          <displayName>ADC1BUF7</displayName>
          <description>ADC1BUF7</description>
          <addressOffset>0x30e</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC1BUF7</name>
              <description>ADC1BUF7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF8</name>
          <displayName>ADC1BUF8</displayName>
          <description>ADC1BUF8</description>
          <addressOffset>0x310</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC1BUF8</name>
              <description>ADC1BUF8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF9</name>
          <displayName>ADC1BUF9</displayName>
          <description>ADC1BUF9</description>
          <addressOffset>0x312</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC1BUF9</name>
              <description>ADC1BUF9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUFA</name>
          <displayName>ADC1BUFA</displayName>
          <description>ADC1BUFA</description>
          <addressOffset>0x314</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC1BUFA</name>
              <description>ADC1BUFA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUFB</name>
          <displayName>ADC1BUFB</displayName>
          <description>ADC1BUFB</description>
          <addressOffset>0x316</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC1BUFB</name>
              <description>ADC1BUFB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUFC</name>
          <displayName>ADC1BUFC</displayName>
          <description>ADC1BUFC</description>
          <addressOffset>0x318</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC1BUFC</name>
              <description>ADC1BUFC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUFD</name>
          <displayName>ADC1BUFD</displayName>
          <description>ADC1BUFD</description>
          <addressOffset>0x31a</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC1BUFD</name>
              <description>ADC1BUFD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUFE</name>
          <displayName>ADC1BUFE</displayName>
          <description>ADC1BUFE</description>
          <addressOffset>0x31c</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC1BUFE</name>
              <description>ADC1BUFE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUFF</name>
          <displayName>ADC1BUFF</displayName>
          <description>ADC1BUFF</description>
          <addressOffset>0x31e</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC1BUFF</name>
              <description>ADC1BUFF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON1</name>
          <displayName>AD1CON1</displayName>
          <description>AD1CON1</description>
          <addressOffset>0x320</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xb7ff</resetMask>
          <fields>
            <field>
              <name>DONE</name>
              <description>DONE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON2</name>
          <displayName>AD1CON2</displayName>
          <description>AD1CON2</description>
          <addressOffset>0x322</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xe7ff</resetMask>
          <fields>
            <field>
              <name>ALTS</name>
              <description>ALTS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON3</name>
          <displayName>AD1CON3</displayName>
          <description>AD1CON3</description>
          <addressOffset>0x324</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x9fff</resetMask>
          <fields>
            <field>
              <name>ADCS</name>
              <description>ADCS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CHS123</name>
          <displayName>AD1CHS123</displayName>
          <description>AD1CHS123</description>
          <addressOffset>0x326</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x707</resetMask>
          <fields>
            <field>
              <name>CH123SA0</name>
              <description>CH123SA0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CHS0</name>
          <displayName>AD1CHS0</displayName>
          <description>AD1CHS0</description>
          <addressOffset>0x328</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8080</resetMask>
          <fields>
            <field>
              <name>CH0SA</name>
              <description>CH0SA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CSSH</name>
          <displayName>AD1CSSH</displayName>
          <description>AD1CSSH</description>
          <addressOffset>0x32e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>CSS16</name>
              <description>CSS16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CSSL</name>
          <displayName>AD1CSSL</displayName>
          <description>AD1CSSL</description>
          <addressOffset>0x330</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>CSS0</name>
              <description>CSS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON4</name>
          <displayName>AD1CON4</displayName>
          <description>AD1CON4</description>
          <addressOffset>0x332</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x107</resetMask>
          <fields>
            <field>
              <name>DMABL</name>
              <description>DMABL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTMUCON1</name>
          <displayName>CTMUCON1</displayName>
          <description>CTMUCON1</description>
          <addressOffset>0x33a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xbf00</resetMask>
          <fields>
            <field>
              <name>CTTRIG</name>
              <description>CTTRIG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTMUCON2</name>
          <displayName>CTMUCON2</displayName>
          <description>CTMUCON2</description>
          <addressOffset>0x33c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xc3c0</resetMask>
          <fields>
            <field>
              <name>EDG2SEL</name>
              <description>EDG2SEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTMUICON</name>
          <displayName>CTMUICON</displayName>
          <description>CTMUICON</description>
          <addressOffset>0x33e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff00</resetMask>
          <fields>
            <field>
              <name>IRNG</name>
              <description>IRNG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC2BUF0</name>
          <displayName>ADC2BUF0</displayName>
          <description>ADC2BUF0</description>
          <addressOffset>0x340</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC2BUF0</name>
              <description>ADC2BUF0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC2BUF1</name>
          <displayName>ADC2BUF1</displayName>
          <description>ADC2BUF1</description>
          <addressOffset>0x342</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC2BUF1</name>
              <description>ADC2BUF1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC2BUF2</name>
          <displayName>ADC2BUF2</displayName>
          <description>ADC2BUF2</description>
          <addressOffset>0x344</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC2BUF2</name>
              <description>ADC2BUF2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC2BUF3</name>
          <displayName>ADC2BUF3</displayName>
          <description>ADC2BUF3</description>
          <addressOffset>0x346</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC2BUF3</name>
              <description>ADC2BUF3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC2BUF4</name>
          <displayName>ADC2BUF4</displayName>
          <description>ADC2BUF4</description>
          <addressOffset>0x348</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC2BUF4</name>
              <description>ADC2BUF4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC2BUF5</name>
          <displayName>ADC2BUF5</displayName>
          <description>ADC2BUF5</description>
          <addressOffset>0x34a</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC2BUF5</name>
              <description>ADC2BUF5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
