xsession/openocd/svd/microchip/dspic33ep128gm604.svd
        <register>
          <name>ADC2BUF6</name>
          <displayName>ADC2BUF6</displayName>
          <description>ADC2BUF6</description>
          <addressOffset>0x34c</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC2BUF6</name>
              <description>ADC2BUF6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC2BUF7</name>
          <displayName>ADC2BUF7</displayName>
          <description>ADC2BUF7</description>
          <addressOffset>0x34e</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC2BUF7</name>
              <description>ADC2BUF7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC2BUF8</name>
          <displayName>ADC2BUF8</displayName>
          <description>ADC2BUF8</description>
          <addressOffset>0x350</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC2BUF8</name>
              <description>ADC2BUF8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC2BUF9</name>
          <displayName>ADC2BUF9</displayName>
          <description>ADC2BUF9</description>
          <addressOffset>0x352</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC2BUF9</name>
              <description>ADC2BUF9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC2BUFA</name>
          <displayName>ADC2BUFA</displayName>
          <description>ADC2BUFA</description>
          <addressOffset>0x354</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC2BUFA</name>
              <description>ADC2BUFA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC2BUFB</name>
          <displayName>ADC2BUFB</displayName>
          <description>ADC2BUFB</description>
          <addressOffset>0x356</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC2BUFB</name>
              <description>ADC2BUFB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC2BUFC</name>
          <displayName>ADC2BUFC</displayName>
          <description>ADC2BUFC</description>
          <addressOffset>0x358</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC2BUFC</name>
              <description>ADC2BUFC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC2BUFD</name>
          <displayName>ADC2BUFD</displayName>
          <description>ADC2BUFD</description>
          <addressOffset>0x35a</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC2BUFD</name>
              <description>ADC2BUFD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC2BUFE</name>
          <displayName>ADC2BUFE</displayName>
          <description>ADC2BUFE</description>
          <addressOffset>0x35c</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC2BUFE</name>
              <description>ADC2BUFE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC2BUFF</name>
          <displayName>ADC2BUFF</displayName>
          <description>ADC2BUFF</description>
          <addressOffset>0x35e</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADC2BUFF</name>
              <description>ADC2BUFF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AD2CON1</name>
          <displayName>AD2CON1</displayName>
          <description>AD2CON1</description>
          <addressOffset>0x360</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xb7ff</resetMask>
          <fields>
            <field>
              <name>DONE</name>
              <description>DONE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AD2CON2</name>
          <displayName>AD2CON2</displayName>
          <description>AD2CON2</description>
          <addressOffset>0x362</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xe7ff</resetMask>
          <fields>
            <field>
              <name>ALTS</name>
              <description>ALTS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AD2CON3</name>
          <displayName>AD2CON3</displayName>
          <description>AD2CON3</description>
          <addressOffset>0x364</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x9fff</resetMask>
          <fields>
            <field>
              <name>ADCS</name>
              <description>ADCS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AD2CHS123</name>
          <displayName>AD2CHS123</displayName>
          <description>AD2CHS123</description>
          <addressOffset>0x366</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x707</resetMask>
          <fields>
            <field>
              <name>CH123SA0</name>
              <description>CH123SA0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AD2CHS0</name>
          <displayName>AD2CHS0</displayName>
          <description>AD2CHS0</description>
          <addressOffset>0x368</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8080</resetMask>
          <fields>
            <field>
              <name>CH0SA</name>
              <description>CH0SA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AD2CSSH</name>
          <displayName>AD2CSSH</displayName>
          <description>AD2CSSH</description>
          <addressOffset>0x36e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>CSS16</name>
              <description>CSS16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AD2CSSL</name>
          <displayName>AD2CSSL</displayName>
          <description>AD2CSSL</description>
          <addressOffset>0x370</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>CSS0</name>
              <description>CSS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AD2CON4</name>
          <displayName>AD2CON4</displayName>
          <description>AD2CON4</description>
          <addressOffset>0x372</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x107</resetMask>
          <fields>
            <field>
              <name>DMABL</name>
              <description>DMABL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1CTRL1</name>
          <displayName>C1CTRL1</displayName>
          <description>C1CTRL1</description>
          <addressOffset>0x400</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x480</resetValue>
          <resetMask>0xf7ff</resetMask>
          <fields>
            <field>
              <name>WIN</name>
              <description>WIN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1CTRL2</name>
          <displayName>C1CTRL2</displayName>
          <description>C1CTRL2</description>
          <addressOffset>0x402</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>DNCNT</name>
              <description>DNCNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1VEC</name>
          <displayName>C1VEC</displayName>
          <description>C1VEC</description>
          <addressOffset>0x404</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x4</resetValue>
          <resetMask>0x4</resetMask>
          <fields>
            <field>
              <name>ICODE</name>
              <description>ICODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FCTRL</name>
          <displayName>C1FCTRL</displayName>
          <description>C1FCTRL</description>
          <addressOffset>0x406</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>FSA</name>
              <description>FSA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFO</name>
          <displayName>C1FIFO</displayName>
          <description>C1FIFO</description>
          <addressOffset>0x408</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>FNRB</name>
              <description>FNRB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1INTF</name>
          <displayName>C1INTF</displayName>
          <description>C1INTF</description>
          <addressOffset>0x40a</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TBIF</name>
              <description>TBIF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1INTE</name>
          <displayName>C1INTE</displayName>
          <description>C1INTE</description>
          <addressOffset>0x40c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TBIE</name>
              <description>TBIE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1EC</name>
          <displayName>C1EC</displayName>
          <description>C1EC</description>
          <addressOffset>0x40e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RERRCNT</name>
              <description>RERRCNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1CFG1</name>
          <displayName>C1CFG1</displayName>
          <description>C1CFG1</description>
          <addressOffset>0x410</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>BRP</name>
              <description>BRP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1CFG2</name>
          <displayName>C1CFG2</displayName>
          <description>C1CFG2</description>
          <addressOffset>0x412</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x47ff</resetMask>
          <fields>
            <field>
              <name>PRSEG</name>
              <description>PRSEG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FEN1</name>
          <displayName>C1FEN1</displayName>
          <description>C1FEN1</description>
          <addressOffset>0x414</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>FLTEN0</name>
              <description>FLTEN0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FMSKSEL1</name>
          <displayName>C1FMSKSEL1</displayName>
          <description>C1FMSKSEL1</description>
          <addressOffset>0x418</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>F0MSK</name>
              <description>F0MSK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FMSKSEL2</name>
          <displayName>C1FMSKSEL2</displayName>
          <description>C1FMSKSEL2</description>
          <addressOffset>0x41a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>F8MSK</name>
              <description>F8MSK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXFUL1</name>
          <displayName>C1RXFUL1</displayName>
          <description>C1RXFUL1</description>
          <addressOffset>0x420</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RXFUL0</name>
              <description>RXFUL0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXFUL2</name>
          <displayName>C1RXFUL2</displayName>
          <description>C1RXFUL2</description>
          <addressOffset>0x422</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RXFUL16</name>
              <description>RXFUL16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1BUFPNT3</name>
          <displayName>C1BUFPNT3</displayName>
          <description>C1BUFPNT3</description>
          <addressOffset>0x424</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>F8BP</name>
              <description>F8BP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1BUFPNT4</name>
          <displayName>C1BUFPNT4</displayName>
          <description>C1BUFPNT4</description>
          <addressOffset>0x426</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>F12BP</name>
              <description>F12BP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXOVF1</name>
          <displayName>C1RXOVF1</displayName>
          <description>C1RXOVF1</description>
          <addressOffset>0x428</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RXOVF0</name>
              <description>RXOVF0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXOVF2</name>
          <displayName>C1RXOVF2</displayName>
          <description>C1RXOVF2</description>
          <addressOffset>0x42a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RXOVF16</name>
              <description>RXOVF16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TR01CON</name>
          <displayName>C1TR01CON</displayName>
          <description>C1TR01CON</description>
          <addressOffset>0x430</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TX0PRI</name>
              <description>TX0PRI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TR23CON</name>
          <displayName>C1TR23CON</displayName>
          <description>C1TR23CON</description>
          <addressOffset>0x432</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TX2PRI</name>
              <description>TX2PRI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TR45CON</name>
          <displayName>C1TR45CON</displayName>
          <description>C1TR45CON</description>
          <addressOffset>0x434</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TX4PRI</name>
              <description>TX4PRI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
