xsession/openocd/svd/microchip/dspic33ep128gm604.svd
        <register>
          <name>C2EC</name>
          <displayName>C2EC</displayName>
          <description>C2EC</description>
          <addressOffset>0x50e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RERRCNT</name>
              <description>RERRCNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2CFG1</name>
          <displayName>C2CFG1</displayName>
          <description>C2CFG1</description>
          <addressOffset>0x510</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>BRP</name>
              <description>BRP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2CFG2</name>
          <displayName>C2CFG2</displayName>
          <description>C2CFG2</description>
          <addressOffset>0x512</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x47ff</resetMask>
          <fields>
            <field>
              <name>PRSEG</name>
              <description>PRSEG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FEN1</name>
          <displayName>C2FEN1</displayName>
          <description>C2FEN1</description>
          <addressOffset>0x514</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>FLTEN0</name>
              <description>FLTEN0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FMSKSEL1</name>
          <displayName>C2FMSKSEL1</displayName>
          <description>C2FMSKSEL1</description>
          <addressOffset>0x518</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>F0MSK</name>
              <description>F0MSK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FMSKSEL2</name>
          <displayName>C2FMSKSEL2</displayName>
          <description>C2FMSKSEL2</description>
          <addressOffset>0x51a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>F8MSK</name>
              <description>F8MSK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXFUL1</name>
          <displayName>C2RXFUL1</displayName>
          <description>C2RXFUL1</description>
          <addressOffset>0x520</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RXFUL0</name>
              <description>RXFUL0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXFUL2</name>
          <displayName>C2RXFUL2</displayName>
          <description>C2RXFUL2</description>
          <addressOffset>0x522</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RXFUL16</name>
              <description>RXFUL16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2BUFPNT3</name>
          <displayName>C2BUFPNT3</displayName>
          <description>C2BUFPNT3</description>
          <addressOffset>0x524</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>F8BP</name>
              <description>F8BP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2BUFPNT4</name>
          <displayName>C2BUFPNT4</displayName>
          <description>C2BUFPNT4</description>
          <addressOffset>0x526</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>F12BP</name>
              <description>F12BP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXOVF1</name>
          <displayName>C2RXOVF1</displayName>
          <description>C2RXOVF1</description>
          <addressOffset>0x528</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RXOVF0</name>
              <description>RXOVF0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXOVF2</name>
          <displayName>C2RXOVF2</displayName>
          <description>C2RXOVF2</description>
          <addressOffset>0x52a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RXOVF16</name>
              <description>RXOVF16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TR01CON</name>
          <displayName>C2TR01CON</displayName>
          <description>C2TR01CON</description>
          <addressOffset>0x530</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TX0PRI</name>
              <description>TX0PRI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TR23CON</name>
          <displayName>C2TR23CON</displayName>
          <description>C2TR23CON</description>
          <addressOffset>0x532</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TX2PRI</name>
              <description>TX2PRI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TR45CON</name>
          <displayName>C2TR45CON</displayName>
          <description>C2TR45CON</description>
          <addressOffset>0x534</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TX4PRI</name>
              <description>TX4PRI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TR67CON</name>
          <displayName>C2TR67CON</displayName>
          <description>C2TR67CON</description>
          <addressOffset>0x536</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TX6PRI</name>
              <description>TX6PRI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXM2SID</name>
          <displayName>C2RXM2SID</displayName>
          <description>C2RXM2SID</description>
          <addressOffset>0x538</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID16</name>
              <description>EID16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXM2EID</name>
          <displayName>C2RXM2EID</displayName>
          <description>C2RXM2EID</description>
          <addressOffset>0x53a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXD</name>
          <displayName>C2RXD</displayName>
          <description>C2RXD</description>
          <addressOffset>0x540</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>C2RXD</name>
              <description>C2RXD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TXD</name>
          <displayName>C2TXD</displayName>
          <description>C2TXD</description>
          <addressOffset>0x542</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>C2TXD</name>
              <description>C2TXD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF1SID</name>
          <displayName>C2RXF1SID</displayName>
          <description>C2RXF1SID</description>
          <addressOffset>0x544</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID16</name>
              <description>EID16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF1EID</name>
          <displayName>C2RXF1EID</displayName>
          <description>C2RXF1EID</description>
          <addressOffset>0x546</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF2SID</name>
          <displayName>C2RXF2SID</displayName>
          <description>C2RXF2SID</description>
          <addressOffset>0x548</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID16</name>
              <description>EID16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF2EID</name>
          <displayName>C2RXF2EID</displayName>
          <description>C2RXF2EID</description>
          <addressOffset>0x54a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF3SID</name>
          <displayName>C2RXF3SID</displayName>
          <description>C2RXF3SID</description>
          <addressOffset>0x54c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID16</name>
              <description>EID16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF3EID</name>
          <displayName>C2RXF3EID</displayName>
          <description>C2RXF3EID</description>
          <addressOffset>0x54e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF4SID</name>
          <displayName>C2RXF4SID</displayName>
          <description>C2RXF4SID</description>
          <addressOffset>0x550</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID16</name>
              <description>EID16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF4EID</name>
          <displayName>C2RXF4EID</displayName>
          <description>C2RXF4EID</description>
          <addressOffset>0x552</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF5SID</name>
          <displayName>C2RXF5SID</displayName>
          <description>C2RXF5SID</description>
          <addressOffset>0x554</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID16</name>
              <description>EID16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF5EID</name>
          <displayName>C2RXF5EID</displayName>
          <description>C2RXF5EID</description>
          <addressOffset>0x556</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF6SID</name>
          <displayName>C2RXF6SID</displayName>
          <description>C2RXF6SID</description>
          <addressOffset>0x558</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID16</name>
              <description>EID16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF6EID</name>
          <displayName>C2RXF6EID</displayName>
          <description>C2RXF6EID</description>
          <addressOffset>0x55a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF7SID</name>
          <displayName>C2RXF7SID</displayName>
          <description>C2RXF7SID</description>
          <addressOffset>0x55c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID16</name>
              <description>EID16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF7EID</name>
          <displayName>C2RXF7EID</displayName>
          <description>C2RXF7EID</description>
          <addressOffset>0x55e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF8SID</name>
          <displayName>C2RXF8SID</displayName>
          <description>C2RXF8SID</description>
          <addressOffset>0x560</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID16</name>
              <description>EID16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF8EID</name>
          <displayName>C2RXF8EID</displayName>
          <description>C2RXF8EID</description>
          <addressOffset>0x562</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF9SID</name>
          <displayName>C2RXF9SID</displayName>
          <description>C2RXF9SID</description>
          <addressOffset>0x564</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID16</name>
              <description>EID16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF9EID</name>
          <displayName>C2RXF9EID</displayName>
          <description>C2RXF9EID</description>
          <addressOffset>0x566</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF10SID</name>
          <displayName>C2RXF10SID</displayName>
          <description>C2RXF10SID</description>
          <addressOffset>0x568</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID16</name>
              <description>EID16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF10EID</name>
          <displayName>C2RXF10EID</displayName>
          <description>C2RXF10EID</description>
          <addressOffset>0x56a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
