xsession/openocd/svd/microchip/dspic33ep128gm604.svd
        <register>
          <name>C2RXF11SID</name>
          <displayName>C2RXF11SID</displayName>
          <description>C2RXF11SID</description>
          <addressOffset>0x56c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID16</name>
              <description>EID16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF11EID</name>
          <displayName>C2RXF11EID</displayName>
          <description>C2RXF11EID</description>
          <addressOffset>0x56e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF12SID</name>
          <displayName>C2RXF12SID</displayName>
          <description>C2RXF12SID</description>
          <addressOffset>0x570</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID16</name>
              <description>EID16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF12EID</name>
          <displayName>C2RXF12EID</displayName>
          <description>C2RXF12EID</description>
          <addressOffset>0x572</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF13SID</name>
          <displayName>C2RXF13SID</displayName>
          <description>C2RXF13SID</description>
          <addressOffset>0x574</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID16</name>
              <description>EID16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF13EID</name>
          <displayName>C2RXF13EID</displayName>
          <description>C2RXF13EID</description>
          <addressOffset>0x576</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF14SID</name>
          <displayName>C2RXF14SID</displayName>
          <description>C2RXF14SID</description>
          <addressOffset>0x578</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID16</name>
              <description>EID16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF14EID</name>
          <displayName>C2RXF14EID</displayName>
          <description>C2RXF14EID</description>
          <addressOffset>0x57a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF15SID</name>
          <displayName>C2RXF15SID</displayName>
          <description>C2RXF15SID</description>
          <addressOffset>0x57c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID16</name>
              <description>EID16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF15EID</name>
          <displayName>C2RXF15EID</displayName>
          <description>C2RXF15EID</description>
          <addressOffset>0x57e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>QEI2CON</name>
          <displayName>QEI2CON</displayName>
          <description>QEI2CON</description>
          <addressOffset>0x5c0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>CCM</name>
              <description>CCM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>QEI2IOC</name>
          <displayName>QEI2IOC</displayName>
          <description>QEI2IOC</description>
          <addressOffset>0x5c2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>QEA</name>
              <description>QEA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>QEI2STAT</name>
          <displayName>QEI2STAT</displayName>
          <description>QEI2STAT</description>
          <addressOffset>0x5c4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>IDXIEN</name>
              <description>IDXIEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>POS2CNTL</name>
          <displayName>POS2CNTL</displayName>
          <description>POS2CNTL</description>
          <addressOffset>0x5c6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>POSCNTL</name>
              <description>POSCNTL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>POS2CNTH</name>
          <displayName>POS2CNTH</displayName>
          <description>POS2CNTH</description>
          <addressOffset>0x5c8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>POSCNTH</name>
              <description>POSCNTH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>POS2HLD</name>
          <displayName>POS2HLD</displayName>
          <description>POS2HLD</description>
          <addressOffset>0x5ca</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>POSHLD</name>
              <description>POSHLD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VEL2CNT</name>
          <displayName>VEL2CNT</displayName>
          <description>VEL2CNT</description>
          <addressOffset>0x5cc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>VELCNT</name>
              <description>VELCNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INT2TMRL</name>
          <displayName>INT2TMRL</displayName>
          <description>INT2TMRL</description>
          <addressOffset>0x5ce</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>INTTMRL</name>
              <description>INTTMRL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INT2TMRH</name>
          <displayName>INT2TMRH</displayName>
          <description>INT2TMRH</description>
          <addressOffset>0x5d0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>INTTMRH</name>
              <description>INTTMRH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INT2HLDL</name>
          <displayName>INT2HLDL</displayName>
          <description>INT2HLDL</description>
          <addressOffset>0x5d2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>INTHLDL</name>
              <description>INTHLDL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INT2HLDH</name>
          <displayName>INT2HLDH</displayName>
          <description>INT2HLDH</description>
          <addressOffset>0x5d4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>INTHLDH</name>
              <description>INTHLDH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INDX2CNTL</name>
          <displayName>INDX2CNTL</displayName>
          <description>INDX2CNTL</description>
          <addressOffset>0x5d6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>INDXCNTL</name>
              <description>INDXCNTL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INDX2CNTH</name>
          <displayName>INDX2CNTH</displayName>
          <description>INDX2CNTH</description>
          <addressOffset>0x5d8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>INDXCNTH</name>
              <description>INDXCNTH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INDX2HLD</name>
          <displayName>INDX2HLD</displayName>
          <description>INDX2HLD</description>
          <addressOffset>0x5da</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>INDXHLD</name>
              <description>INDXHLD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>QEI2GECL</name>
          <displayName>QEI2GECL</displayName>
          <description>QEI2GECL</description>
          <addressOffset>0x5dc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>QEIGEC</name>
              <description>QEIGEC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>QEI2GECH</name>
          <displayName>QEI2GECH</displayName>
          <description>QEI2GECH</description>
          <addressOffset>0x5de</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>QEIGEC</name>
              <description>QEIGEC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>QEI2LECL</name>
          <displayName>QEI2LECL</displayName>
          <description>QEI2LECL</description>
          <addressOffset>0x5e0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>QEILEC</name>
              <description>QEILEC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>QEI2LECH</name>
          <displayName>QEI2LECH</displayName>
          <description>QEI2LECH</description>
          <addressOffset>0x5e2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>QEILEC</name>
              <description>QEILEC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ALRMVAL</name>
          <displayName>ALRMVAL</displayName>
          <description>ALRMVAL</description>
          <addressOffset>0x620</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>ALRMVAL</name>
              <description>ALRMVAL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ALCFGRPT</name>
          <displayName>ALCFGRPT</displayName>
          <description>ALCFGRPT</description>
          <addressOffset>0x622</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>ARPT</name>
              <description>ARPT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCVAL</name>
          <displayName>RTCVAL</displayName>
          <description>RTCVAL</description>
          <addressOffset>0x624</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RTCVAL</name>
              <description>RTCVAL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RCFGCAL</name>
          <displayName>RCFGCAL</displayName>
          <description>RCFGCAL</description>
          <addressOffset>0x626</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xbfff</resetMask>
          <fields>
            <field>
              <name>CAL</name>
              <description>CAL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCCON1</name>
          <displayName>CRCCON1</displayName>
          <description>CRCCON1</description>
          <addressOffset>0x640</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x40</resetValue>
          <resetMask>0xbfd8</resetMask>
          <fields>
            <field>
              <name>LENDIAN</name>
              <description>LENDIAN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCCON2</name>
          <displayName>CRCCON2</displayName>
          <description>CRCCON2</description>
          <addressOffset>0x642</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>PLEN</name>
              <description>PLEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCXORL</name>
          <displayName>CRCXORL</displayName>
          <description>CRCXORL</description>
          <addressOffset>0x644</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xfffe</resetMask>
          <fields>
            <field>
              <name>X1</name>
              <description>X1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCXORH</name>
          <displayName>CRCXORH</displayName>
          <description>CRCXORH</description>
          <addressOffset>0x646</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>X16</name>
              <description>X16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCDATL</name>
          <displayName>CRCDATL</displayName>
          <description>CRCDATL</description>
          <addressOffset>0x648</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>CRCDATL</name>
              <description>CRCDATL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCDATH</name>
          <displayName>CRCDATH</displayName>
          <description>CRCDATH</description>
          <addressOffset>0x64a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>CRCDATH</name>
              <description>CRCDATH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCWDATL</name>
          <displayName>CRCWDATL</displayName>
          <description>CRCWDATL</description>
          <addressOffset>0x64c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>CRCWDATL</name>
              <description>CRCWDATL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCWDATH</name>
          <displayName>CRCWDATH</displayName>
          <description>CRCWDATH</description>
          <addressOffset>0x64e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>CRCWDATH</name>
              <description>CRCWDATH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
