xsession/openocd/svd/microchip/dspic33ep128gm604.svd
        <register>
          <name>RPOR0</name>
          <displayName>RPOR0</displayName>
          <description>RPOR0</description>
          <addressOffset>0x680</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RP20R</name>
              <description>RP20R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR1</name>
          <displayName>RPOR1</displayName>
          <description>RPOR1</description>
          <addressOffset>0x682</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RP36R</name>
              <description>RP36R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR2</name>
          <displayName>RPOR2</displayName>
          <description>RPOR2</description>
          <addressOffset>0x684</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RP38R</name>
              <description>RP38R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR3</name>
          <displayName>RPOR3</displayName>
          <description>RPOR3</description>
          <addressOffset>0x686</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RP40R</name>
              <description>RP40R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR4</name>
          <displayName>RPOR4</displayName>
          <description>RPOR4</description>
          <addressOffset>0x688</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RP42R</name>
              <description>RP42R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR5</name>
          <displayName>RPOR5</displayName>
          <description>RPOR5</description>
          <addressOffset>0x68a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RP48R</name>
              <description>RP48R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR6</name>
          <displayName>RPOR6</displayName>
          <description>RPOR6</description>
          <addressOffset>0x68c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RP54R</name>
              <description>RP54R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR7</name>
          <displayName>RPOR7</displayName>
          <description>RPOR7</description>
          <addressOffset>0x68e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RP56R</name>
              <description>RP56R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR8</name>
          <displayName>RPOR8</displayName>
          <description>RPOR8</description>
          <addressOffset>0x690</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RP69R</name>
              <description>RP69R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR9</name>
          <displayName>RPOR9</displayName>
          <description>RPOR9</description>
          <addressOffset>0x692</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RP81R</name>
              <description>RP81R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR10</name>
          <displayName>RPOR10</displayName>
          <description>RPOR10</description>
          <addressOffset>0x694</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RP113R</name>
              <description>RP113R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR11</name>
          <displayName>RPOR11</displayName>
          <description>RPOR11</description>
          <addressOffset>0x696</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RP120R</name>
              <description>RP120R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR12</name>
          <displayName>RPOR12</displayName>
          <description>RPOR12</description>
          <addressOffset>0x698</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RP126R</name>
              <description>RP126R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR0</name>
          <displayName>RPINR0</displayName>
          <description>RPINR0</description>
          <addressOffset>0x6a0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f00</resetMask>
          <fields>
            <field>
              <name>INT1R</name>
              <description>INT1R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR1</name>
          <displayName>RPINR1</displayName>
          <description>RPINR1</description>
          <addressOffset>0x6a2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f</resetMask>
          <fields>
            <field>
              <name>INT2R</name>
              <description>INT2R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR3</name>
          <displayName>RPINR3</displayName>
          <description>RPINR3</description>
          <addressOffset>0x6a6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f</resetMask>
          <fields>
            <field>
              <name>T2CKR</name>
              <description>T2CKR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR7</name>
          <displayName>RPINR7</displayName>
          <description>RPINR7</description>
          <addressOffset>0x6ae</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f7f</resetMask>
          <fields>
            <field>
              <name>IC1R</name>
              <description>IC1R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR8</name>
          <displayName>RPINR8</displayName>
          <description>RPINR8</description>
          <addressOffset>0x6b0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f7f</resetMask>
          <fields>
            <field>
              <name>IC3R</name>
              <description>IC3R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR9</name>
          <displayName>RPINR9</displayName>
          <description>RPINR9</description>
          <addressOffset>0x6b2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f7f</resetMask>
          <fields>
            <field>
              <name>IC5R</name>
              <description>IC5R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR10</name>
          <displayName>RPINR10</displayName>
          <description>RPINR10</description>
          <addressOffset>0x6b4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f7f</resetMask>
          <fields>
            <field>
              <name>IC7R</name>
              <description>IC7R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR11</name>
          <displayName>RPINR11</displayName>
          <description>RPINR11</description>
          <addressOffset>0x6b6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f</resetMask>
          <fields>
            <field>
              <name>OCFAR</name>
              <description>OCFAR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR12</name>
          <displayName>RPINR12</displayName>
          <description>RPINR12</description>
          <addressOffset>0x6b8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f7f</resetMask>
          <fields>
            <field>
              <name>FLT1R</name>
              <description>FLT1R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR14</name>
          <displayName>RPINR14</displayName>
          <description>RPINR14</description>
          <addressOffset>0x6bc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f7f</resetMask>
          <fields>
            <field>
              <name>QEA1R</name>
              <description>QEA1R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR15</name>
          <displayName>RPINR15</displayName>
          <description>RPINR15</description>
          <addressOffset>0x6be</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f7f</resetMask>
          <fields>
            <field>
              <name>INDX1R</name>
              <description>INDX1R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR16</name>
          <displayName>RPINR16</displayName>
          <description>RPINR16</description>
          <addressOffset>0x6c0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f7f</resetMask>
          <fields>
            <field>
              <name>QEA2R</name>
              <description>QEA2R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR17</name>
          <displayName>RPINR17</displayName>
          <description>RPINR17</description>
          <addressOffset>0x6c2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f7f</resetMask>
          <fields>
            <field>
              <name>INDX2R</name>
              <description>INDX2R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR18</name>
          <displayName>RPINR18</displayName>
          <description>RPINR18</description>
          <addressOffset>0x6c4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f</resetMask>
          <fields>
            <field>
              <name>U1RXR</name>
              <description>U1RXR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR19</name>
          <displayName>RPINR19</displayName>
          <description>RPINR19</description>
          <addressOffset>0x6c6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f</resetMask>
          <fields>
            <field>
              <name>U2RXR</name>
              <description>U2RXR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR22</name>
          <displayName>RPINR22</displayName>
          <description>RPINR22</description>
          <addressOffset>0x6cc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f7f</resetMask>
          <fields>
            <field>
              <name>SDI2R</name>
              <description>SDI2R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR23</name>
          <displayName>RPINR23</displayName>
          <description>RPINR23</description>
          <addressOffset>0x6ce</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f</resetMask>
          <fields>
            <field>
              <name>SS2R</name>
              <description>SS2R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR24</name>
          <displayName>RPINR24</displayName>
          <description>RPINR24</description>
          <addressOffset>0x6d0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f7f</resetMask>
          <fields>
            <field>
              <name>CSDIR</name>
              <description>CSDIR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR25</name>
          <displayName>RPINR25</displayName>
          <description>RPINR25</description>
          <addressOffset>0x6d2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f</resetMask>
          <fields>
            <field>
              <name>COFSR</name>
              <description>COFSR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR26</name>
          <displayName>RPINR26</displayName>
          <description>RPINR26</description>
          <addressOffset>0x6d4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f7f</resetMask>
          <fields>
            <field>
              <name>C1RXR</name>
              <description>C1RXR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR27</name>
          <displayName>RPINR27</displayName>
          <description>RPINR27</description>
          <addressOffset>0x6d6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f7f</resetMask>
          <fields>
            <field>
              <name>U3RXR</name>
              <description>U3RXR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR28</name>
          <displayName>RPINR28</displayName>
          <description>RPINR28</description>
          <addressOffset>0x6d8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f7f</resetMask>
          <fields>
            <field>
              <name>U4RXR</name>
              <description>U4RXR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR29</name>
          <displayName>RPINR29</displayName>
          <description>RPINR29</description>
          <addressOffset>0x6da</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f7f</resetMask>
          <fields>
            <field>
              <name>SDI3R</name>
              <description>SDI3R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR30</name>
          <displayName>RPINR30</displayName>
          <description>RPINR30</description>
          <addressOffset>0x6dc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f</resetMask>
          <fields>
            <field>
              <name>SS3R</name>
              <description>SS3R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR37</name>
          <displayName>RPINR37</displayName>
          <description>RPINR37</description>
          <addressOffset>0x6ea</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f00</resetMask>
          <fields>
            <field>
              <name>SYNCI1R</name>
              <description>SYNCI1R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR38</name>
          <displayName>RPINR38</displayName>
          <description>RPINR38</description>
          <addressOffset>0x6ec</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f00</resetMask>
          <fields>
            <field>
              <name>DTCMP1R</name>
              <description>DTCMP1R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR39</name>
          <displayName>RPINR39</displayName>
          <description>RPINR39</description>
          <addressOffset>0x6ee</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f7f</resetMask>
          <fields>
            <field>
              <name>DTCMP2R</name>
              <description>DTCMP2R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR40</name>
          <displayName>RPINR40</displayName>
          <description>RPINR40</description>
          <addressOffset>0x6f0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f7f</resetMask>
          <fields>
            <field>
              <name>DTCMP4R</name>
              <description>DTCMP4R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
