xsession/openocd/svd/microchip/dspic33ep128gm604.svd
        <register>
          <name>RPINR41</name>
          <displayName>RPINR41</displayName>
          <description>RPINR41</description>
          <addressOffset>0x6f2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f</resetMask>
          <fields>
            <field>
              <name>DTCMP6R</name>
              <description>DTCMP6R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMCON</name>
          <displayName>NVMCON</displayName>
          <description>NVMCON</description>
          <addressOffset>0x728</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xe00f</resetMask>
          <fields>
            <field>
              <name>NVMOP</name>
              <description>NVMOP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMADR</name>
          <displayName>NVMADR</displayName>
          <description>NVMADR</description>
          <addressOffset>0x72a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>NVMADR</name>
              <description>NVMADR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMADRU</name>
          <displayName>NVMADRU</displayName>
          <description>NVMADRU</description>
          <addressOffset>0x72c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>NVMADRU</name>
              <description>NVMADRU</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMKEY</name>
          <displayName>NVMKEY</displayName>
          <description>NVMKEY</description>
          <addressOffset>0x72e</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>NVMKEY</name>
              <description>NVMKEY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMSRCADRL</name>
          <displayName>NVMSRCADRL</displayName>
          <description>NVMSRCADRL</description>
          <addressOffset>0x730</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>NVMSRCADRL</name>
              <description>NVMSRCADRL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMSRCADRH</name>
          <displayName>NVMSRCADRH</displayName>
          <description>NVMSRCADRH</description>
          <addressOffset>0x732</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>NVMSRCADRH</name>
              <description>NVMSRCADRH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RCON</name>
          <displayName>RCON</displayName>
          <description>RCON</description>
          <addressOffset>0x740</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x3</resetValue>
          <resetMask>0xc3ff</resetMask>
          <fields>
            <field>
              <name>POR</name>
              <description>POR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCON</name>
          <displayName>OSCCON</displayName>
          <description>OSCCON</description>
          <addressOffset>0x742</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x70e9</resetMask>
          <fields>
            <field>
              <name>OSWEN</name>
              <description>OSWEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKDIV</name>
          <displayName>CLKDIV</displayName>
          <description>CLKDIV</description>
          <addressOffset>0x744</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x3040</resetValue>
          <resetMask>0xffdf</resetMask>
          <fields>
            <field>
              <name>PLLPRE</name>
              <description>PLLPRE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLFBD</name>
          <displayName>PLLFBD</displayName>
          <description>PLLFBD</description>
          <addressOffset>0x746</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x30</resetValue>
          <resetMask>0x1ff</resetMask>
          <fields>
            <field>
              <name>PLLDIV</name>
              <description>PLLDIV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCTUN</name>
          <displayName>OSCTUN</displayName>
          <description>OSCTUN</description>
          <addressOffset>0x748</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3f</resetMask>
          <fields>
            <field>
              <name>TUN</name>
              <description>TUN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>REFOCON</name>
          <displayName>REFOCON</displayName>
          <description>REFOCON</description>
          <addressOffset>0x74e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xbf00</resetMask>
          <fields>
            <field>
              <name>RODIV</name>
              <description>RODIV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD1</name>
          <displayName>PMD1</displayName>
          <description>PMD1</description>
          <addressOffset>0x760</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xfefb</resetMask>
          <fields>
            <field>
              <name>AD1MD</name>
              <description>AD1MD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD2</name>
          <displayName>PMD2</displayName>
          <description>PMD2</description>
          <addressOffset>0x762</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf0f</resetMask>
          <fields>
            <field>
              <name>OC1MD</name>
              <description>OC1MD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD3</name>
          <displayName>PMD3</displayName>
          <description>PMD3</description>
          <addressOffset>0x764</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x402</resetMask>
          <fields>
            <field>
              <name>ADC2MD</name>
              <description>ADC2MD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD4</name>
          <displayName>PMD4</displayName>
          <description>PMD4</description>
          <addressOffset>0x766</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8</resetMask>
          <fields>
            <field>
              <name>CTMUMD</name>
              <description>CTMUMD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD6</name>
          <displayName>PMD6</displayName>
          <description>PMD6</description>
          <addressOffset>0x76a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x700</resetMask>
          <fields>
            <field>
              <name>SPI3MD</name>
              <description>SPI3MD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD7</name>
          <displayName>PMD7</displayName>
          <description>PMD7</description>
          <addressOffset>0x76c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>PTGMD</name>
              <description>PTGMD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS0</name>
          <displayName>IFS0</displayName>
          <description>IFS0</description>
          <addressOffset>0x800</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>INT0IF</name>
              <description>INT0IF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS1</name>
          <displayName>IFS1</displayName>
          <description>IFS1</description>
          <addressOffset>0x802</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SI2C1IF</name>
              <description>SI2C1IF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS2</name>
          <displayName>IFS2</displayName>
          <description>IFS2</description>
          <addressOffset>0x804</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x9fff</resetMask>
          <fields>
            <field>
              <name>SPI2EIF</name>
              <description>SPI2EIF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS3</name>
          <displayName>IFS3</displayName>
          <description>IFS3</description>
          <addressOffset>0x806</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x5fff</resetMask>
          <fields>
            <field>
              <name>T7IF</name>
              <description>T7IF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS4</name>
          <displayName>IFS4</displayName>
          <description>IFS4</description>
          <addressOffset>0x808</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x2ace</resetMask>
          <fields>
            <field>
              <name>U1EIF</name>
              <description>U1EIF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS5</name>
          <displayName>IFS5</displayName>
          <description>IFS5</description>
          <addressOffset>0x80a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xcf8e</resetMask>
          <fields>
            <field>
              <name>U3EIF</name>
              <description>U3EIF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS6</name>
          <displayName>IFS6</displayName>
          <description>IFS6</description>
          <addressOffset>0x80c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf</resetMask>
          <fields>
            <field>
              <name>PWM3IF</name>
              <description>PWM3IF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS8</name>
          <displayName>IFS8</displayName>
          <description>IFS8</description>
          <addressOffset>0x810</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xc000</resetMask>
          <fields>
            <field>
              <name>ICDIF</name>
              <description>ICDIF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS9</name>
          <displayName>IFS9</displayName>
          <description>IFS9</description>
          <addressOffset>0x812</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7e</resetMask>
          <fields>
            <field>
              <name>PTGSTEPIF</name>
              <description>PTGSTEPIF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC0</name>
          <displayName>IEC0</displayName>
          <description>IEC0</description>
          <addressOffset>0x820</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>INT0IE</name>
              <description>INT0IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC1</name>
          <displayName>IEC1</displayName>
          <description>IEC1</description>
          <addressOffset>0x822</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SI2C1IE</name>
              <description>SI2C1IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC2</name>
          <displayName>IEC2</displayName>
          <description>IEC2</description>
          <addressOffset>0x824</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x9fff</resetMask>
          <fields>
            <field>
              <name>SPI2EIE</name>
              <description>SPI2EIE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC3</name>
          <displayName>IEC3</displayName>
          <description>IEC3</description>
          <addressOffset>0x826</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x5fff</resetMask>
          <fields>
            <field>
              <name>T7IE</name>
              <description>T7IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC4</name>
          <displayName>IEC4</displayName>
          <description>IEC4</description>
          <addressOffset>0x828</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x2ace</resetMask>
          <fields>
            <field>
              <name>U1EIE</name>
              <description>U1EIE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC5</name>
          <displayName>IEC5</displayName>
          <description>IEC5</description>
          <addressOffset>0x82a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xcf8e</resetMask>
          <fields>
            <field>
              <name>U3EIE</name>
              <description>U3EIE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC6</name>
          <displayName>IEC6</displayName>
          <description>IEC6</description>
          <addressOffset>0x82c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf</resetMask>
          <fields>
            <field>
              <name>PWM3IE</name>
              <description>PWM3IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC8</name>
          <displayName>IEC8</displayName>
          <description>IEC8</description>
          <addressOffset>0x830</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xc000</resetMask>
          <fields>
            <field>
              <name>ICDIE</name>
              <description>ICDIE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC9</name>
          <displayName>IEC9</displayName>
          <description>IEC9</description>
          <addressOffset>0x832</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7e</resetMask>
          <fields>
            <field>
              <name>PTGSTEPIE</name>
              <description>PTGSTEPIE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC0</name>
          <displayName>IPC0</displayName>
          <description>IPC0</description>
          <addressOffset>0x840</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4444</resetValue>
          <resetMask>0x7777</resetMask>
          <fields>
            <field>
              <name>INT0IP</name>
              <description>INT0IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC1</name>
          <displayName>IPC1</displayName>
          <description>IPC1</description>
          <addressOffset>0x842</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4444</resetValue>
          <resetMask>0x7777</resetMask>
          <fields>
            <field>
              <name>DMA0IP</name>
              <description>DMA0IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC2</name>
          <displayName>IPC2</displayName>
          <description>IPC2</description>
          <addressOffset>0x844</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4444</resetValue>
          <resetMask>0x7777</resetMask>
          <fields>
            <field>
              <name>T3IP</name>
              <description>T3IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC3</name>
          <displayName>IPC3</displayName>
          <description>IPC3</description>
          <addressOffset>0x846</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x444</resetValue>
          <resetMask>0x777</resetMask>
          <fields>
            <field>
              <name>U1TXIP</name>
              <description>U1TXIP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
