xsession/openocd/svd/microchip/dspic33ep128gm604.svd
        <register>
          <name>IPC4</name>
          <displayName>IPC4</displayName>
          <description>IPC4</description>
          <addressOffset>0x848</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4444</resetValue>
          <resetMask>0x7777</resetMask>
          <fields>
            <field>
              <name>SI2C1IP</name>
              <description>SI2C1IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC5</name>
          <displayName>IPC5</displayName>
          <description>IPC5</description>
          <addressOffset>0x84a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4444</resetValue>
          <resetMask>0x7777</resetMask>
          <fields>
            <field>
              <name>INT1IP</name>
              <description>INT1IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC6</name>
          <displayName>IPC6</displayName>
          <description>IPC6</description>
          <addressOffset>0x84c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4444</resetValue>
          <resetMask>0x7777</resetMask>
          <fields>
            <field>
              <name>DMA2IP</name>
              <description>DMA2IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC7</name>
          <displayName>IPC7</displayName>
          <description>IPC7</description>
          <addressOffset>0x84e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4444</resetValue>
          <resetMask>0x7777</resetMask>
          <fields>
            <field>
              <name>T5IP</name>
              <description>T5IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC8</name>
          <displayName>IPC8</displayName>
          <description>IPC8</description>
          <addressOffset>0x850</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4444</resetValue>
          <resetMask>0x7777</resetMask>
          <fields>
            <field>
              <name>SPI2EIP</name>
              <description>SPI2EIP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC9</name>
          <displayName>IPC9</displayName>
          <description>IPC9</description>
          <addressOffset>0x852</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4444</resetValue>
          <resetMask>0x7777</resetMask>
          <fields>
            <field>
              <name>DMA3IP</name>
              <description>DMA3IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC10</name>
          <displayName>IPC10</displayName>
          <description>IPC10</description>
          <addressOffset>0x854</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4444</resetValue>
          <resetMask>0x7777</resetMask>
          <fields>
            <field>
              <name>IC6IP</name>
              <description>IC6IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC11</name>
          <displayName>IPC11</displayName>
          <description>IPC11</description>
          <addressOffset>0x856</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4004</resetValue>
          <resetMask>0x7007</resetMask>
          <fields>
            <field>
              <name>OC8IP</name>
              <description>OC8IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC12</name>
          <displayName>IPC12</displayName>
          <description>IPC12</description>
          <addressOffset>0x858</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4444</resetValue>
          <resetMask>0x7777</resetMask>
          <fields>
            <field>
              <name>T7IP</name>
              <description>T7IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC13</name>
          <displayName>IPC13</displayName>
          <description>IPC13</description>
          <addressOffset>0x85a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4444</resetValue>
          <resetMask>0x7777</resetMask>
          <fields>
            <field>
              <name>T9IP</name>
              <description>T9IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC14</name>
          <displayName>IPC14</displayName>
          <description>IPC14</description>
          <addressOffset>0x85c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4444</resetValue>
          <resetMask>0x7777</resetMask>
          <fields>
            <field>
              <name>C2IP</name>
              <description>C2IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC15</name>
          <displayName>IPC15</displayName>
          <description>IPC15</description>
          <addressOffset>0x85e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x404</resetValue>
          <resetMask>0x707</resetMask>
          <fields>
            <field>
              <name>DCIIP</name>
              <description>DCIIP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC16</name>
          <displayName>IPC16</displayName>
          <description>IPC16</description>
          <addressOffset>0x860</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x440</resetValue>
          <resetMask>0x770</resetMask>
          <fields>
            <field>
              <name>U1EIP</name>
              <description>U1EIP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC17</name>
          <displayName>IPC17</displayName>
          <description>IPC17</description>
          <addressOffset>0x862</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4400</resetValue>
          <resetMask>0x7700</resetMask>
          <fields>
            <field>
              <name>C1TXIP</name>
              <description>C1TXIP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC18</name>
          <displayName>IPC18</displayName>
          <description>IPC18</description>
          <addressOffset>0x864</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4040</resetValue>
          <resetMask>0x7070</resetMask>
          <fields>
            <field>
              <name>PCESIP</name>
              <description>PCESIP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC19</name>
          <displayName>IPC19</displayName>
          <description>IPC19</description>
          <addressOffset>0x866</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x40</resetValue>
          <resetMask>0x70</resetMask>
          <fields>
            <field>
              <name>CTMUIP</name>
              <description>CTMUIP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC20</name>
          <displayName>IPC20</displayName>
          <description>IPC20</description>
          <addressOffset>0x868</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4440</resetValue>
          <resetMask>0x7770</resetMask>
          <fields>
            <field>
              <name>U3EIP</name>
              <description>U3EIP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC21</name>
          <displayName>IPC21</displayName>
          <description>IPC21</description>
          <addressOffset>0x86a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4000</resetValue>
          <resetMask>0x7000</resetMask>
          <fields>
            <field>
              <name>U4EIP</name>
              <description>U4EIP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC22</name>
          <displayName>IPC22</displayName>
          <description>IPC22</description>
          <addressOffset>0x86c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4444</resetValue>
          <resetMask>0x7777</resetMask>
          <fields>
            <field>
              <name>U4RXIP</name>
              <description>U4RXIP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC23</name>
          <displayName>IPC23</displayName>
          <description>IPC23</description>
          <addressOffset>0x86e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4400</resetValue>
          <resetMask>0x7700</resetMask>
          <fields>
            <field>
              <name>PWM1IP</name>
              <description>PWM1IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC24</name>
          <displayName>IPC24</displayName>
          <description>IPC24</description>
          <addressOffset>0x870</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4444</resetValue>
          <resetMask>0x7777</resetMask>
          <fields>
            <field>
              <name>PWM3IP</name>
              <description>PWM3IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC35</name>
          <displayName>IPC35</displayName>
          <description>IPC35</description>
          <addressOffset>0x886</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4400</resetValue>
          <resetMask>0x7700</resetMask>
          <fields>
            <field>
              <name>ICDIP</name>
              <description>ICDIP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC36</name>
          <displayName>IPC36</displayName>
          <description>IPC36</description>
          <addressOffset>0x888</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4440</resetValue>
          <resetMask>0x7770</resetMask>
          <fields>
            <field>
              <name>PTGSTEPIP</name>
              <description>PTGSTEPIP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC37</name>
          <displayName>IPC37</displayName>
          <description>IPC37</description>
          <addressOffset>0x88a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x444</resetValue>
          <resetMask>0x777</resetMask>
          <fields>
            <field>
              <name>PTG1IP</name>
              <description>PTG1IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCON1</name>
          <displayName>INTCON1</displayName>
          <description>INTCON1</description>
          <addressOffset>0x8c0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>OSCFAIL</name>
              <description>OSCFAIL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCON2</name>
          <displayName>INTCON2</displayName>
          <description>INTCON2</description>
          <addressOffset>0x8c2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8000</resetValue>
          <resetMask>0xe01f</resetMask>
          <fields>
            <field>
              <name>INT0EP</name>
              <description>INT0EP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCON3</name>
          <displayName>INTCON3</displayName>
          <description>INTCON3</description>
          <addressOffset>0x8c4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x30</resetMask>
          <fields>
            <field>
              <name>DOOVR</name>
              <description>DOOVR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCON4</name>
          <displayName>INTCON4</displayName>
          <description>INTCON4</description>
          <addressOffset>0x8c6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>SGHT</name>
              <description>SGHT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTTREG</name>
          <displayName>INTTREG</displayName>
          <description>INTTREG</description>
          <addressOffset>0x8c8</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xfff</resetMask>
          <fields>
            <field>
              <name>VECNUM</name>
              <description>VECNUM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC1CON1</name>
          <displayName>OC1CON1</displayName>
          <description>OC1CON1</description>
          <addressOffset>0x900</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3dbf</resetMask>
          <fields>
            <field>
              <name>OCM</name>
              <description>OCM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC1CON2</name>
          <displayName>OC1CON2</displayName>
          <description>OC1CON2</description>
          <addressOffset>0x902</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xc</resetValue>
          <resetMask>0xf1ff</resetMask>
          <fields>
            <field>
              <name>SYNCSEL</name>
              <description>SYNCSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC1RS</name>
          <displayName>OC1RS</displayName>
          <description>OC1RS</description>
          <addressOffset>0x904</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC1RS</name>
              <description>OC1RS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC1R</name>
          <displayName>OC1R</displayName>
          <description>OC1R</description>
          <addressOffset>0x906</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC1R</name>
              <description>OC1R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC1TMR</name>
          <displayName>OC1TMR</displayName>
          <description>OC1TMR</description>
          <addressOffset>0x908</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC1TMR</name>
              <description>OC1TMR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC2CON1</name>
          <displayName>OC2CON1</displayName>
          <description>OC2CON1</description>
          <addressOffset>0x90a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3dbf</resetMask>
          <fields>
            <field>
              <name>OCM</name>
              <description>OCM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC2CON2</name>
          <displayName>OC2CON2</displayName>
          <description>OC2CON2</description>
          <addressOffset>0x90c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xc</resetValue>
          <resetMask>0xf1ff</resetMask>
          <fields>
            <field>
              <name>SYNCSEL</name>
              <description>SYNCSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC2RS</name>
          <displayName>OC2RS</displayName>
          <description>OC2RS</description>
          <addressOffset>0x90e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC2RS</name>
              <description>OC2RS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC2R</name>
          <displayName>OC2R</displayName>
          <description>OC2R</description>
          <addressOffset>0x910</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC2R</name>
              <description>OC2R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC2TMR</name>
          <displayName>OC2TMR</displayName>
          <description>OC2TMR</description>
          <addressOffset>0x912</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC2TMR</name>
              <description>OC2TMR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC3CON1</name>
          <displayName>OC3CON1</displayName>
          <description>OC3CON1</description>
          <addressOffset>0x914</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3dbf</resetMask>
          <fields>
            <field>
              <name>OCM</name>
              <description>OCM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC3CON2</name>
          <displayName>OC3CON2</displayName>
          <description>OC3CON2</description>
          <addressOffset>0x916</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xc</resetValue>
          <resetMask>0xf1ff</resetMask>
          <fields>
            <field>
              <name>SYNCSEL</name>
              <description>SYNCSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
