xsession/openocd/svd/microchip/dspic33ep128gm604.svd
        <register>
          <name>OC3RS</name>
          <displayName>OC3RS</displayName>
          <description>OC3RS</description>
          <addressOffset>0x918</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC3RS</name>
              <description>OC3RS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC3R</name>
          <displayName>OC3R</displayName>
          <description>OC3R</description>
          <addressOffset>0x91a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC3R</name>
              <description>OC3R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC3TMR</name>
          <displayName>OC3TMR</displayName>
          <description>OC3TMR</description>
          <addressOffset>0x91c</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC3TMR</name>
              <description>OC3TMR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC4CON1</name>
          <displayName>OC4CON1</displayName>
          <description>OC4CON1</description>
          <addressOffset>0x91e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3dbf</resetMask>
          <fields>
            <field>
              <name>OCM</name>
              <description>OCM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC4CON2</name>
          <displayName>OC4CON2</displayName>
          <description>OC4CON2</description>
          <addressOffset>0x920</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xc</resetValue>
          <resetMask>0xf1ff</resetMask>
          <fields>
            <field>
              <name>SYNCSEL</name>
              <description>SYNCSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC4RS</name>
          <displayName>OC4RS</displayName>
          <description>OC4RS</description>
          <addressOffset>0x922</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC4RS</name>
              <description>OC4RS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC4R</name>
          <displayName>OC4R</displayName>
          <description>OC4R</description>
          <addressOffset>0x924</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC4R</name>
              <description>OC4R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC4TMR</name>
          <displayName>OC4TMR</displayName>
          <description>OC4TMR</description>
          <addressOffset>0x926</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC4TMR</name>
              <description>OC4TMR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC5CON1</name>
          <displayName>OC5CON1</displayName>
          <description>OC5CON1</description>
          <addressOffset>0x928</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3dbf</resetMask>
          <fields>
            <field>
              <name>OCM</name>
              <description>OCM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC5CON2</name>
          <displayName>OC5CON2</displayName>
          <description>OC5CON2</description>
          <addressOffset>0x92a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xc</resetValue>
          <resetMask>0xf1ff</resetMask>
          <fields>
            <field>
              <name>SYNCSEL</name>
              <description>SYNCSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC5RS</name>
          <displayName>OC5RS</displayName>
          <description>OC5RS</description>
          <addressOffset>0x92c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC5RS</name>
              <description>OC5RS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC5R</name>
          <displayName>OC5R</displayName>
          <description>OC5R</description>
          <addressOffset>0x92e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC5R</name>
              <description>OC5R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC5TMR</name>
          <displayName>OC5TMR</displayName>
          <description>OC5TMR</description>
          <addressOffset>0x930</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC5TMR</name>
              <description>OC5TMR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC6CON1</name>
          <displayName>OC6CON1</displayName>
          <description>OC6CON1</description>
          <addressOffset>0x932</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3dbf</resetMask>
          <fields>
            <field>
              <name>OCM</name>
              <description>OCM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC6CON2</name>
          <displayName>OC6CON2</displayName>
          <description>OC6CON2</description>
          <addressOffset>0x934</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xc</resetValue>
          <resetMask>0xf1ff</resetMask>
          <fields>
            <field>
              <name>SYNCSEL</name>
              <description>SYNCSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC6RS</name>
          <displayName>OC6RS</displayName>
          <description>OC6RS</description>
          <addressOffset>0x936</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC6RS</name>
              <description>OC6RS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC6R</name>
          <displayName>OC6R</displayName>
          <description>OC6R</description>
          <addressOffset>0x938</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC6R</name>
              <description>OC6R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC6TMR</name>
          <displayName>OC6TMR</displayName>
          <description>OC6TMR</description>
          <addressOffset>0x93a</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC6TMR</name>
              <description>OC6TMR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC7CON1</name>
          <displayName>OC7CON1</displayName>
          <description>OC7CON1</description>
          <addressOffset>0x93c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3dbf</resetMask>
          <fields>
            <field>
              <name>OCM</name>
              <description>OCM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC7CON2</name>
          <displayName>OC7CON2</displayName>
          <description>OC7CON2</description>
          <addressOffset>0x93e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xc</resetValue>
          <resetMask>0xf1ff</resetMask>
          <fields>
            <field>
              <name>SYNCSEL</name>
              <description>SYNCSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC7RS</name>
          <displayName>OC7RS</displayName>
          <description>OC7RS</description>
          <addressOffset>0x940</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC7RS</name>
              <description>OC7RS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC7R</name>
          <displayName>OC7R</displayName>
          <description>OC7R</description>
          <addressOffset>0x942</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC7R</name>
              <description>OC7R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC7TMR</name>
          <displayName>OC7TMR</displayName>
          <description>OC7TMR</description>
          <addressOffset>0x944</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC7TMR</name>
              <description>OC7TMR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC8CON1</name>
          <displayName>OC8CON1</displayName>
          <description>OC8CON1</description>
          <addressOffset>0x946</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3dbf</resetMask>
          <fields>
            <field>
              <name>OCM</name>
              <description>OCM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC8CON2</name>
          <displayName>OC8CON2</displayName>
          <description>OC8CON2</description>
          <addressOffset>0x948</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xc</resetValue>
          <resetMask>0xf1ff</resetMask>
          <fields>
            <field>
              <name>SYNCSEL</name>
              <description>SYNCSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC8RS</name>
          <displayName>OC8RS</displayName>
          <description>OC8RS</description>
          <addressOffset>0x94a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC8RS</name>
              <description>OC8RS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC8R</name>
          <displayName>OC8R</displayName>
          <description>OC8R</description>
          <addressOffset>0x94c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC8R</name>
              <description>OC8R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC8TMR</name>
          <displayName>OC8TMR</displayName>
          <description>OC8TMR</description>
          <addressOffset>0x94e</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC8TMR</name>
              <description>OC8TMR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMSTAT</name>
          <displayName>CMSTAT</displayName>
          <description>CMSTAT</description>
          <addressOffset>0xa80</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x9f1f</resetMask>
          <fields>
            <field>
              <name>C1OUT</name>
              <description>C1OUT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CVR1CON</name>
          <displayName>CVR1CON</displayName>
          <description>CVR1CON</description>
          <addressOffset>0xa82</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x4ff</resetMask>
          <fields>
            <field>
              <name>CVR</name>
              <description>CVR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CM1CON</name>
          <displayName>CM1CON</displayName>
          <description>CM1CON</description>
          <addressOffset>0xa84</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xe3d0</resetMask>
          <fields>
            <field>
              <name>CCH</name>
              <description>CCH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CM1MSKSRC</name>
          <displayName>CM1MSKSRC</displayName>
          <description>CM1MSKSRC</description>
          <addressOffset>0xa86</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>SELSRCA</name>
              <description>SELSRCA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CM1MSKCON</name>
          <displayName>CM1MSKCON</displayName>
          <description>CM1MSKCON</description>
          <addressOffset>0xa88</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>AANEN</name>
              <description>AANEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CM1FLTR</name>
          <displayName>CM1FLTR</displayName>
          <description>CM1FLTR</description>
          <addressOffset>0xa8a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>CFDIV</name>
              <description>CFDIV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CM2CON</name>
          <displayName>CM2CON</displayName>
          <description>CM2CON</description>
          <addressOffset>0xa8c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xe3d0</resetMask>
          <fields>
            <field>
              <name>CCH</name>
              <description>CCH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CM2MSKSRC</name>
          <displayName>CM2MSKSRC</displayName>
          <description>CM2MSKSRC</description>
          <addressOffset>0xa8e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>SELSRCA</name>
              <description>SELSRCA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CM2MSKCON</name>
          <displayName>CM2MSKCON</displayName>
          <description>CM2MSKCON</description>
          <addressOffset>0xa90</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>AANEN</name>
              <description>AANEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CM2FLTR</name>
          <displayName>CM2FLTR</displayName>
          <description>CM2FLTR</description>
          <addressOffset>0xa92</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>CFDIV</name>
              <description>CFDIV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CM3CON</name>
          <displayName>CM3CON</displayName>
          <description>CM3CON</description>
          <addressOffset>0xa94</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xe3d0</resetMask>
          <fields>
            <field>
              <name>CCH</name>
              <description>CCH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CM3MSKSRC</name>
          <displayName>CM3MSKSRC</displayName>
          <description>CM3MSKSRC</description>
          <addressOffset>0xa96</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>SELSRCA</name>
              <description>SELSRCA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CM3MSKCON</name>
          <displayName>CM3MSKCON</displayName>
          <description>CM3MSKCON</description>
          <addressOffset>0xa98</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>AANEN</name>
              <description>AANEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
