xsession/openocd/svd/microchip/dspic33ep128gm604.svd
        <register>
          <name>CM3FLTR</name>
          <displayName>CM3FLTR</displayName>
          <description>CM3FLTR</description>
          <addressOffset>0xa9a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>CFDIV</name>
              <description>CFDIV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CM4CON</name>
          <displayName>CM4CON</displayName>
          <description>CM4CON</description>
          <addressOffset>0xa9c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xe3d0</resetMask>
          <fields>
            <field>
              <name>CCH</name>
              <description>CCH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CM4MSKSRC</name>
          <displayName>CM4MSKSRC</displayName>
          <description>CM4MSKSRC</description>
          <addressOffset>0xa9e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>SELSRCA</name>
              <description>SELSRCA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CM4MSKCON</name>
          <displayName>CM4MSKCON</displayName>
          <description>CM4MSKCON</description>
          <addressOffset>0xaa0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>AANEN</name>
              <description>AANEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CM4FLTR</name>
          <displayName>CM4FLTR</displayName>
          <description>CM4FLTR</description>
          <addressOffset>0xaa2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>CFDIV</name>
              <description>CFDIV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CM5CON</name>
          <displayName>CM5CON</displayName>
          <description>CM5CON</description>
          <addressOffset>0xaa4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xe3d0</resetMask>
          <fields>
            <field>
              <name>CCH</name>
              <description>CCH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CM5MSKSRC</name>
          <displayName>CM5MSKSRC</displayName>
          <description>CM5MSKSRC</description>
          <addressOffset>0xaa6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>SELSRCA</name>
              <description>SELSRCA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CM5MSKCON</name>
          <displayName>CM5MSKCON</displayName>
          <description>CM5MSKCON</description>
          <addressOffset>0xaa8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>AANEN</name>
              <description>AANEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CM5FLTR</name>
          <displayName>CM5FLTR</displayName>
          <description>CM5FLTR</description>
          <addressOffset>0xaaa</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>CFDIV</name>
              <description>CFDIV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CVR2CON</name>
          <displayName>CVR2CON</displayName>
          <description>CVR2CON</description>
          <addressOffset>0xab4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>CVR</name>
              <description>CVR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTGCST</name>
          <displayName>PTGCST</displayName>
          <description>PTGCST</description>
          <addressOffset>0xac0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xb400</resetMask>
          <fields>
            <field>
              <name>PTGITM</name>
              <description>PTGITM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTGCON</name>
          <displayName>PTGCON</displayName>
          <description>PTGCON</description>
          <addressOffset>0xac2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>PTGWDT</name>
              <description>PTGWDT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTGBTE</name>
          <displayName>PTGBTE</displayName>
          <description>PTGBTE</description>
          <addressOffset>0xac4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>PTGBTE</name>
              <description>PTGBTE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTGHOLD</name>
          <displayName>PTGHOLD</displayName>
          <description>PTGHOLD</description>
          <addressOffset>0xac6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>PTGHOLD</name>
              <description>PTGHOLD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTGT0LIM</name>
          <displayName>PTGT0LIM</displayName>
          <description>PTGT0LIM</description>
          <addressOffset>0xac8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>PTGT0LIM</name>
              <description>PTGT0LIM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTGT1LIM</name>
          <displayName>PTGT1LIM</displayName>
          <description>PTGT1LIM</description>
          <addressOffset>0xaca</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>PTGT1LIM</name>
              <description>PTGT1LIM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTGSDLIM</name>
          <displayName>PTGSDLIM</displayName>
          <description>PTGSDLIM</description>
          <addressOffset>0xacc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>PTGSDLIM</name>
              <description>PTGSDLIM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTGC0LIM</name>
          <displayName>PTGC0LIM</displayName>
          <description>PTGC0LIM</description>
          <addressOffset>0xace</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>PTGC0LIM</name>
              <description>PTGC0LIM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTGC1LIM</name>
          <displayName>PTGC1LIM</displayName>
          <description>PTGC1LIM</description>
          <addressOffset>0xad0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>PTGC1LIM</name>
              <description>PTGC1LIM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTGADJ</name>
          <displayName>PTGADJ</displayName>
          <description>PTGADJ</description>
          <addressOffset>0xad2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>PTGADJ</name>
              <description>PTGADJ</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTGL0</name>
          <displayName>PTGL0</displayName>
          <description>PTGL0</description>
          <addressOffset>0xad4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>PTGL0</name>
              <description>PTGL0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTGQPTR</name>
          <displayName>PTGQPTR</displayName>
          <description>PTGQPTR</description>
          <addressOffset>0xad6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>PTGQPTR</name>
              <description>PTGQPTR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTGQUE0</name>
          <displayName>PTGQUE0</displayName>
          <description>PTGQUE0</description>
          <addressOffset>0xad8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>STEP0</name>
              <description>STEP0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTGQUE1</name>
          <displayName>PTGQUE1</displayName>
          <description>PTGQUE1</description>
          <addressOffset>0xada</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>STEP2</name>
              <description>STEP2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTGQUE2</name>
          <displayName>PTGQUE2</displayName>
          <description>PTGQUE2</description>
          <addressOffset>0xadc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>STEP4</name>
              <description>STEP4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTGQUE3</name>
          <displayName>PTGQUE3</displayName>
          <description>PTGQUE3</description>
          <addressOffset>0xade</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>STEP6</name>
              <description>STEP6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTGQUE4</name>
          <displayName>PTGQUE4</displayName>
          <description>PTGQUE4</description>
          <addressOffset>0xae0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>STEP8</name>
              <description>STEP8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTGQUE5</name>
          <displayName>PTGQUE5</displayName>
          <description>PTGQUE5</description>
          <addressOffset>0xae2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>STEP10</name>
              <description>STEP10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTGQUE6</name>
          <displayName>PTGQUE6</displayName>
          <description>PTGQUE6</description>
          <addressOffset>0xae4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>STEP12</name>
              <description>STEP12</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTGQUE7</name>
          <displayName>PTGQUE7</displayName>
          <description>PTGQUE7</description>
          <addressOffset>0xae6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>STEP14</name>
              <description>STEP14</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTGQUE8</name>
          <displayName>PTGQUE8</displayName>
          <description>PTGQUE8</description>
          <addressOffset>0xae8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>STEP16</name>
              <description>STEP16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTGQUE9</name>
          <displayName>PTGQUE9</displayName>
          <description>PTGQUE9</description>
          <addressOffset>0xaea</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>STEP18</name>
              <description>STEP18</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTGQUE10</name>
          <displayName>PTGQUE10</displayName>
          <description>PTGQUE10</description>
          <addressOffset>0xaec</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>STEP20</name>
              <description>STEP20</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTGQUE11</name>
          <displayName>PTGQUE11</displayName>
          <description>PTGQUE11</description>
          <addressOffset>0xaee</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>STEP22</name>
              <description>STEP22</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTGQUE12</name>
          <displayName>PTGQUE12</displayName>
          <description>PTGQUE12</description>
          <addressOffset>0xaf0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>STEP24</name>
              <description>STEP24</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTGQUE13</name>
          <displayName>PTGQUE13</displayName>
          <description>PTGQUE13</description>
          <addressOffset>0xaf2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>STEP26</name>
              <description>STEP26</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTGQUE14</name>
          <displayName>PTGQUE14</displayName>
          <description>PTGQUE14</description>
          <addressOffset>0xaf4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>STEP28</name>
              <description>STEP28</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTGQUE15</name>
          <displayName>PTGQUE15</displayName>
          <description>PTGQUE15</description>
          <addressOffset>0xaf6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>STEP30</name>
              <description>STEP30</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0CON</name>
          <displayName>DMA0CON</displayName>
          <description>DMA0CON</description>
          <addressOffset>0xb00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf833</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0REQ</name>
          <displayName>DMA0REQ</displayName>
          <description>DMA0REQ</description>
          <addressOffset>0xb02</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8000</resetMask>
          <fields>
            <field>
              <name>IRQSEL</name>
              <description>IRQSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
