xsession/openocd/svd/microchip/dspic33ep128gm604.svd
        <register>
          <name>DMA0STAL</name>
          <displayName>DMA0STAL</displayName>
          <description>DMA0STAL</description>
          <addressOffset>0xb04</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>STA</name>
              <description>STA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0STAH</name>
          <displayName>DMA0STAH</displayName>
          <description>DMA0STAH</description>
          <addressOffset>0xb06</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>STA</name>
              <description>STA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0STBL</name>
          <displayName>DMA0STBL</displayName>
          <description>DMA0STBL</description>
          <addressOffset>0xb08</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>STB</name>
              <description>STB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0STBH</name>
          <displayName>DMA0STBH</displayName>
          <description>DMA0STBH</description>
          <addressOffset>0xb0a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>STB</name>
              <description>STB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0PAD</name>
          <displayName>DMA0PAD</displayName>
          <description>DMA0PAD</description>
          <addressOffset>0xb0c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PAD</name>
              <description>PAD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0CNT</name>
          <displayName>DMA0CNT</displayName>
          <description>DMA0CNT</description>
          <addressOffset>0xb0e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3fff</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1CON</name>
          <displayName>DMA1CON</displayName>
          <description>DMA1CON</description>
          <addressOffset>0xb10</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf833</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1REQ</name>
          <displayName>DMA1REQ</displayName>
          <description>DMA1REQ</description>
          <addressOffset>0xb12</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8000</resetMask>
          <fields>
            <field>
              <name>IRQSEL</name>
              <description>IRQSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1STAL</name>
          <displayName>DMA1STAL</displayName>
          <description>DMA1STAL</description>
          <addressOffset>0xb14</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>STA</name>
              <description>STA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1STAH</name>
          <displayName>DMA1STAH</displayName>
          <description>DMA1STAH</description>
          <addressOffset>0xb16</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>STA</name>
              <description>STA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1STBL</name>
          <displayName>DMA1STBL</displayName>
          <description>DMA1STBL</description>
          <addressOffset>0xb18</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>STB</name>
              <description>STB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1STBH</name>
          <displayName>DMA1STBH</displayName>
          <description>DMA1STBH</description>
          <addressOffset>0xb1a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>STB</name>
              <description>STB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1PAD</name>
          <displayName>DMA1PAD</displayName>
          <description>DMA1PAD</description>
          <addressOffset>0xb1c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PAD</name>
              <description>PAD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1CNT</name>
          <displayName>DMA1CNT</displayName>
          <description>DMA1CNT</description>
          <addressOffset>0xb1e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3fff</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2CON</name>
          <displayName>DMA2CON</displayName>
          <description>DMA2CON</description>
          <addressOffset>0xb20</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf833</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2REQ</name>
          <displayName>DMA2REQ</displayName>
          <description>DMA2REQ</description>
          <addressOffset>0xb22</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8000</resetMask>
          <fields>
            <field>
              <name>IRQSEL</name>
              <description>IRQSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2STAL</name>
          <displayName>DMA2STAL</displayName>
          <description>DMA2STAL</description>
          <addressOffset>0xb24</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>STA</name>
              <description>STA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2STAH</name>
          <displayName>DMA2STAH</displayName>
          <description>DMA2STAH</description>
          <addressOffset>0xb26</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>STA</name>
              <description>STA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2STBL</name>
          <displayName>DMA2STBL</displayName>
          <description>DMA2STBL</description>
          <addressOffset>0xb28</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>STB</name>
              <description>STB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2STBH</name>
          <displayName>DMA2STBH</displayName>
          <description>DMA2STBH</description>
          <addressOffset>0xb2a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>STB</name>
              <description>STB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2PAD</name>
          <displayName>DMA2PAD</displayName>
          <description>DMA2PAD</description>
          <addressOffset>0xb2c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PAD</name>
              <description>PAD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2CNT</name>
          <displayName>DMA2CNT</displayName>
          <description>DMA2CNT</description>
          <addressOffset>0xb2e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3fff</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA3CON</name>
          <displayName>DMA3CON</displayName>
          <description>DMA3CON</description>
          <addressOffset>0xb30</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf833</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA3REQ</name>
          <displayName>DMA3REQ</displayName>
          <description>DMA3REQ</description>
          <addressOffset>0xb32</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8000</resetMask>
          <fields>
            <field>
              <name>IRQSEL</name>
              <description>IRQSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA3STAL</name>
          <displayName>DMA3STAL</displayName>
          <description>DMA3STAL</description>
          <addressOffset>0xb34</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>STA</name>
              <description>STA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA3STAH</name>
          <displayName>DMA3STAH</displayName>
          <description>DMA3STAH</description>
          <addressOffset>0xb36</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>STA</name>
              <description>STA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA3STBL</name>
          <displayName>DMA3STBL</displayName>
          <description>DMA3STBL</description>
          <addressOffset>0xb38</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>STB</name>
              <description>STB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA3STBH</name>
          <displayName>DMA3STBH</displayName>
          <description>DMA3STBH</description>
          <addressOffset>0xb3a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>STB</name>
              <description>STB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA3PAD</name>
          <displayName>DMA3PAD</displayName>
          <description>DMA3PAD</description>
          <addressOffset>0xb3c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PAD</name>
              <description>PAD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA3CNT</name>
          <displayName>DMA3CNT</displayName>
          <description>DMA3CNT</description>
          <addressOffset>0xb3e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3fff</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAPWC</name>
          <displayName>DMAPWC</displayName>
          <description>DMAPWC</description>
          <addressOffset>0xbf0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>PWCOL0</name>
              <description>PWCOL0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMARQC</name>
          <displayName>DMARQC</displayName>
          <description>DMARQC</description>
          <addressOffset>0xbf2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RQCOL0</name>
              <description>RQCOL0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAPPS</name>
          <displayName>DMAPPS</displayName>
          <description>DMAPPS</description>
          <addressOffset>0xbf4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>PPST0</name>
              <description>PPST0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMALCA</name>
          <displayName>DMALCA</displayName>
          <description>DMALCA</description>
          <addressOffset>0xbf6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>LSTCH</name>
              <description>LSTCH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DSADRL</name>
          <displayName>DSADRL</displayName>
          <description>DSADRL</description>
          <addressOffset>0xbf8</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>DSADR</name>
              <description>DSADR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DSADRH</name>
          <displayName>DSADRH</displayName>
          <description>DSADRH</description>
          <addressOffset>0xbfa</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>DSADR</name>
              <description>DSADR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTCON</name>
          <displayName>PTCON</displayName>
          <description>PTCON</description>
          <addressOffset>0xc00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xbfff</resetMask>
          <fields>
            <field>
              <name>SEVTPS</name>
              <description>SEVTPS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTCON2</name>
          <displayName>PTCON2</displayName>
          <description>PTCON2</description>
          <addressOffset>0xc02</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>PCLKDIV</name>
              <description>PCLKDIV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTPER</name>
          <displayName>PTPER</displayName>
          <description>PTPER</description>
          <addressOffset>0xc04</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xffff</resetValue>
          <resetMask>0xffff</resetMask>
          <fields>
            <field>
              <name>PTPER</name>
              <description>PTPER</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SEVTCMP</name>
          <displayName>SEVTCMP</displayName>
          <description>SEVTCMP</description>
          <addressOffset>0xc06</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SEVTCMP</name>
              <description>SEVTCMP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDC</name>
          <displayName>MDC</displayName>
          <description>MDC</description>
          <addressOffset>0xc0a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>MDC</name>
              <description>MDC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
