xsession/openocd/svd/microchip/dspic33ep128gm604.svd
        <register>
          <name>STCON</name>
          <displayName>STCON</displayName>
          <description>STCON</description>
          <addressOffset>0xc0e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1fff</resetMask>
          <fields>
            <field>
              <name>SEVTPS</name>
              <description>SEVTPS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STCON2</name>
          <displayName>STCON2</displayName>
          <description>STCON2</description>
          <addressOffset>0xc10</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>PCLKDIV</name>
              <description>PCLKDIV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STPER</name>
          <displayName>STPER</displayName>
          <description>STPER</description>
          <addressOffset>0xc12</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xffff</resetValue>
          <resetMask>0xffff</resetMask>
          <fields>
            <field>
              <name>STPER</name>
              <description>STPER</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SSEVTCMP</name>
          <displayName>SSEVTCMP</displayName>
          <description>SSEVTCMP</description>
          <addressOffset>0xc14</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SSEVTCMP</name>
              <description>SSEVTCMP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHOP</name>
          <displayName>CHOP</displayName>
          <description>CHOP</description>
          <addressOffset>0xc1a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x83ff</resetMask>
          <fields>
            <field>
              <name>CHOPCLK</name>
              <description>CHOPCLK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWMKEY</name>
          <displayName>PWMKEY</displayName>
          <description>PWMKEY</description>
          <addressOffset>0xc1e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>PWMKEY</name>
              <description>PWMKEY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWMCON1</name>
          <displayName>PWMCON1</displayName>
          <description>PWMCON1</description>
          <addressOffset>0xc20</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffef</resetMask>
          <fields>
            <field>
              <name>IUE</name>
              <description>IUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON1</name>
          <displayName>IOCON1</displayName>
          <description>IOCON1</description>
          <addressOffset>0xc22</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>OSYNC</name>
              <description>OSYNC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FCLCON1</name>
          <displayName>FCLCON1</displayName>
          <description>FCLCON1</description>
          <addressOffset>0xc24</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>FLTMOD</name>
              <description>FLTMOD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PDC1</name>
          <displayName>PDC1</displayName>
          <description>PDC1</description>
          <addressOffset>0xc26</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PDC1</name>
              <description>PDC1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PHASE1</name>
          <displayName>PHASE1</displayName>
          <description>PHASE1</description>
          <addressOffset>0xc28</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PHASE1</name>
              <description>PHASE1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DTR1</name>
          <displayName>DTR1</displayName>
          <description>DTR1</description>
          <addressOffset>0xc2a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3fff</resetMask>
          <fields>
            <field>
              <name>DTR1</name>
              <description>DTR1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ALTDTR1</name>
          <displayName>ALTDTR1</displayName>
          <description>ALTDTR1</description>
          <addressOffset>0xc2c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3fff</resetMask>
          <fields>
            <field>
              <name>ALTDTR1</name>
              <description>ALTDTR1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDC1</name>
          <displayName>SDC1</displayName>
          <description>SDC1</description>
          <addressOffset>0xc2e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SDC1</name>
              <description>SDC1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPHASE1</name>
          <displayName>SPHASE1</displayName>
          <description>SPHASE1</description>
          <addressOffset>0xc30</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SPHASE1</name>
              <description>SPHASE1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIG1</name>
          <displayName>TRIG1</displayName>
          <description>TRIG1</description>
          <addressOffset>0xc32</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TRGCMP</name>
              <description>TRGCMP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGCON1</name>
          <displayName>TRGCON1</displayName>
          <description>TRGCON1</description>
          <addressOffset>0xc34</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf03f</resetMask>
          <fields>
            <field>
              <name>TRGSTRT</name>
              <description>TRGSTRT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWMCAP1</name>
          <displayName>PWMCAP1</displayName>
          <description>PWMCAP1</description>
          <addressOffset>0xc38</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PWMCAP</name>
              <description>PWMCAP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LEBCON1</name>
          <displayName>LEBCON1</displayName>
          <description>LEBCON1</description>
          <addressOffset>0xc3a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xfc3f</resetMask>
          <fields>
            <field>
              <name>BPLL</name>
              <description>BPLL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LEBDLY1</name>
          <displayName>LEBDLY1</displayName>
          <description>LEBDLY1</description>
          <addressOffset>0xc3c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xfff</resetMask>
          <fields>
            <field>
              <name>LEB</name>
              <description>LEB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXCON1</name>
          <displayName>AUXCON1</displayName>
          <description>AUXCON1</description>
          <addressOffset>0xc3e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf3f</resetMask>
          <fields>
            <field>
              <name>CHOPLEN</name>
              <description>CHOPLEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWMCON2</name>
          <displayName>PWMCON2</displayName>
          <description>PWMCON2</description>
          <addressOffset>0xc40</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffef</resetMask>
          <fields>
            <field>
              <name>IUE</name>
              <description>IUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON2</name>
          <displayName>IOCON2</displayName>
          <description>IOCON2</description>
          <addressOffset>0xc42</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>OSYNC</name>
              <description>OSYNC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FCLCON2</name>
          <displayName>FCLCON2</displayName>
          <description>FCLCON2</description>
          <addressOffset>0xc44</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>FLTMOD</name>
              <description>FLTMOD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PDC2</name>
          <displayName>PDC2</displayName>
          <description>PDC2</description>
          <addressOffset>0xc46</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PDC2</name>
              <description>PDC2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PHASE2</name>
          <displayName>PHASE2</displayName>
          <description>PHASE2</description>
          <addressOffset>0xc48</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PHASE2</name>
              <description>PHASE2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DTR2</name>
          <displayName>DTR2</displayName>
          <description>DTR2</description>
          <addressOffset>0xc4a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3fff</resetMask>
          <fields>
            <field>
              <name>DTR2</name>
              <description>DTR2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ALTDTR2</name>
          <displayName>ALTDTR2</displayName>
          <description>ALTDTR2</description>
          <addressOffset>0xc4c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3fff</resetMask>
          <fields>
            <field>
              <name>ALTDTR2</name>
              <description>ALTDTR2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDC2</name>
          <displayName>SDC2</displayName>
          <description>SDC2</description>
          <addressOffset>0xc4e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SDC2</name>
              <description>SDC2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPHASE2</name>
          <displayName>SPHASE2</displayName>
          <description>SPHASE2</description>
          <addressOffset>0xc50</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SPHASE2</name>
              <description>SPHASE2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIG2</name>
          <displayName>TRIG2</displayName>
          <description>TRIG2</description>
          <addressOffset>0xc52</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TRGCMP</name>
              <description>TRGCMP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGCON2</name>
          <displayName>TRGCON2</displayName>
          <description>TRGCON2</description>
          <addressOffset>0xc54</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf03f</resetMask>
          <fields>
            <field>
              <name>TRGSTRT</name>
              <description>TRGSTRT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWMCAP2</name>
          <displayName>PWMCAP2</displayName>
          <description>PWMCAP2</description>
          <addressOffset>0xc58</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PWMCAP</name>
              <description>PWMCAP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LEBCON2</name>
          <displayName>LEBCON2</displayName>
          <description>LEBCON2</description>
          <addressOffset>0xc5a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xfc3f</resetMask>
          <fields>
            <field>
              <name>BPLL</name>
              <description>BPLL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LEBDLY2</name>
          <displayName>LEBDLY2</displayName>
          <description>LEBDLY2</description>
          <addressOffset>0xc5c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xfff</resetMask>
          <fields>
            <field>
              <name>LEB</name>
              <description>LEB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXCON2</name>
          <displayName>AUXCON2</displayName>
          <description>AUXCON2</description>
          <addressOffset>0xc5e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf3f</resetMask>
          <fields>
            <field>
              <name>CHOPLEN</name>
              <description>CHOPLEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWMCON3</name>
          <displayName>PWMCON3</displayName>
          <description>PWMCON3</description>
          <addressOffset>0xc60</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffef</resetMask>
          <fields>
            <field>
              <name>IUE</name>
              <description>IUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON3</name>
          <displayName>IOCON3</displayName>
          <description>IOCON3</description>
          <addressOffset>0xc62</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>OSYNC</name>
              <description>OSYNC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FCLCON3</name>
          <displayName>FCLCON3</displayName>
          <description>FCLCON3</description>
          <addressOffset>0xc64</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>FLTMOD</name>
              <description>FLTMOD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PDC3</name>
          <displayName>PDC3</displayName>
          <description>PDC3</description>
          <addressOffset>0xc66</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PDC3</name>
              <description>PDC3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PHASE3</name>
          <displayName>PHASE3</displayName>
          <description>PHASE3</description>
          <addressOffset>0xc68</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PHASE3</name>
              <description>PHASE3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
