xsession/openocd/svd/microchip/dspic33ep128gm604.svd
        <register>
          <name>DTR3</name>
          <displayName>DTR3</displayName>
          <description>DTR3</description>
          <addressOffset>0xc6a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3fff</resetMask>
          <fields>
            <field>
              <name>DTR3</name>
              <description>DTR3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ALTDTR3</name>
          <displayName>ALTDTR3</displayName>
          <description>ALTDTR3</description>
          <addressOffset>0xc6c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3fff</resetMask>
          <fields>
            <field>
              <name>ALTDTR3</name>
              <description>ALTDTR3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDC3</name>
          <displayName>SDC3</displayName>
          <description>SDC3</description>
          <addressOffset>0xc6e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SDC3</name>
              <description>SDC3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPHASE3</name>
          <displayName>SPHASE3</displayName>
          <description>SPHASE3</description>
          <addressOffset>0xc70</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SPHASE3</name>
              <description>SPHASE3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIG3</name>
          <displayName>TRIG3</displayName>
          <description>TRIG3</description>
          <addressOffset>0xc72</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TRGCMP</name>
              <description>TRGCMP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGCON3</name>
          <displayName>TRGCON3</displayName>
          <description>TRGCON3</description>
          <addressOffset>0xc74</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf03f</resetMask>
          <fields>
            <field>
              <name>TRGSTRT</name>
              <description>TRGSTRT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWMCAP3</name>
          <displayName>PWMCAP3</displayName>
          <description>PWMCAP3</description>
          <addressOffset>0xc78</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PWMCAP</name>
              <description>PWMCAP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LEBCON3</name>
          <displayName>LEBCON3</displayName>
          <description>LEBCON3</description>
          <addressOffset>0xc7a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xfc3f</resetMask>
          <fields>
            <field>
              <name>BPLL</name>
              <description>BPLL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LEBDLY3</name>
          <displayName>LEBDLY3</displayName>
          <description>LEBDLY3</description>
          <addressOffset>0xc7c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xfff</resetMask>
          <fields>
            <field>
              <name>LEB</name>
              <description>LEB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXCON3</name>
          <displayName>AUXCON3</displayName>
          <description>AUXCON3</description>
          <addressOffset>0xc7e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf3f</resetMask>
          <fields>
            <field>
              <name>CHOPLEN</name>
              <description>CHOPLEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWMCON4</name>
          <displayName>PWMCON4</displayName>
          <description>PWMCON4</description>
          <addressOffset>0xc80</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffef</resetMask>
          <fields>
            <field>
              <name>IUE</name>
              <description>IUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON4</name>
          <displayName>IOCON4</displayName>
          <description>IOCON4</description>
          <addressOffset>0xc82</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>OSYNC</name>
              <description>OSYNC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FCLCON4</name>
          <displayName>FCLCON4</displayName>
          <description>FCLCON4</description>
          <addressOffset>0xc84</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>FLTMOD</name>
              <description>FLTMOD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PDC4</name>
          <displayName>PDC4</displayName>
          <description>PDC4</description>
          <addressOffset>0xc86</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PDC4</name>
              <description>PDC4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PHASE4</name>
          <displayName>PHASE4</displayName>
          <description>PHASE4</description>
          <addressOffset>0xc88</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PHASE4</name>
              <description>PHASE4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DTR4</name>
          <displayName>DTR4</displayName>
          <description>DTR4</description>
          <addressOffset>0xc8a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3fff</resetMask>
          <fields>
            <field>
              <name>DTR4</name>
              <description>DTR4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ALTDTR4</name>
          <displayName>ALTDTR4</displayName>
          <description>ALTDTR4</description>
          <addressOffset>0xc8c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3fff</resetMask>
          <fields>
            <field>
              <name>ALTDTR4</name>
              <description>ALTDTR4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDC4</name>
          <displayName>SDC4</displayName>
          <description>SDC4</description>
          <addressOffset>0xc8e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SDC4</name>
              <description>SDC4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPHASE4</name>
          <displayName>SPHASE4</displayName>
          <description>SPHASE4</description>
          <addressOffset>0xc90</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SPHASE4</name>
              <description>SPHASE4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIG4</name>
          <displayName>TRIG4</displayName>
          <description>TRIG4</description>
          <addressOffset>0xc92</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TRGCMP</name>
              <description>TRGCMP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGCON4</name>
          <displayName>TRGCON4</displayName>
          <description>TRGCON4</description>
          <addressOffset>0xc94</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf03f</resetMask>
          <fields>
            <field>
              <name>TRGSTRT</name>
              <description>TRGSTRT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWMCAP4</name>
          <displayName>PWMCAP4</displayName>
          <description>PWMCAP4</description>
          <addressOffset>0xc98</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PWMCAP</name>
              <description>PWMCAP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LEBCON4</name>
          <displayName>LEBCON4</displayName>
          <description>LEBCON4</description>
          <addressOffset>0xc9a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xfc3f</resetMask>
          <fields>
            <field>
              <name>BPLL</name>
              <description>BPLL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LEBDLY4</name>
          <displayName>LEBDLY4</displayName>
          <description>LEBDLY4</description>
          <addressOffset>0xc9c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xfff</resetMask>
          <fields>
            <field>
              <name>LEB</name>
              <description>LEB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXCON4</name>
          <displayName>AUXCON4</displayName>
          <description>AUXCON4</description>
          <addressOffset>0xc9e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf3f</resetMask>
          <fields>
            <field>
              <name>CHOPLEN</name>
              <description>CHOPLEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWMCON5</name>
          <displayName>PWMCON5</displayName>
          <description>PWMCON5</description>
          <addressOffset>0xca0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffef</resetMask>
          <fields>
            <field>
              <name>IUE</name>
              <description>IUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON5</name>
          <displayName>IOCON5</displayName>
          <description>IOCON5</description>
          <addressOffset>0xca2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>OSYNC</name>
              <description>OSYNC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FCLCON5</name>
          <displayName>FCLCON5</displayName>
          <description>FCLCON5</description>
          <addressOffset>0xca4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>FLTMOD</name>
              <description>FLTMOD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PDC5</name>
          <displayName>PDC5</displayName>
          <description>PDC5</description>
          <addressOffset>0xca6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PDC5</name>
              <description>PDC5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PHASE5</name>
          <displayName>PHASE5</displayName>
          <description>PHASE5</description>
          <addressOffset>0xca8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PHASE5</name>
              <description>PHASE5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DTR5</name>
          <displayName>DTR5</displayName>
          <description>DTR5</description>
          <addressOffset>0xcaa</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3fff</resetMask>
          <fields>
            <field>
              <name>DTR5</name>
              <description>DTR5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ALTDTR5</name>
          <displayName>ALTDTR5</displayName>
          <description>ALTDTR5</description>
          <addressOffset>0xcac</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3fff</resetMask>
          <fields>
            <field>
              <name>ALTDTR5</name>
              <description>ALTDTR5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDC5</name>
          <displayName>SDC5</displayName>
          <description>SDC5</description>
          <addressOffset>0xcae</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SDC5</name>
              <description>SDC5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPHASE5</name>
          <displayName>SPHASE5</displayName>
          <description>SPHASE5</description>
          <addressOffset>0xcb0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SPHASE5</name>
              <description>SPHASE5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIG5</name>
          <displayName>TRIG5</displayName>
          <description>TRIG5</description>
          <addressOffset>0xcb2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TRGCMP</name>
              <description>TRGCMP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGCON5</name>
          <displayName>TRGCON5</displayName>
          <description>TRGCON5</description>
          <addressOffset>0xcb4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf03f</resetMask>
          <fields>
            <field>
              <name>TRGSTRT</name>
              <description>TRGSTRT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWMCAP5</name>
          <displayName>PWMCAP5</displayName>
          <description>PWMCAP5</description>
          <addressOffset>0xcb8</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PWMCAP</name>
              <description>PWMCAP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LEBCON5</name>
          <displayName>LEBCON5</displayName>
          <description>LEBCON5</description>
          <addressOffset>0xcba</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xfc3f</resetMask>
          <fields>
            <field>
              <name>BPLL</name>
              <description>BPLL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LEBDLY5</name>
          <displayName>LEBDLY5</displayName>
          <description>LEBDLY5</description>
          <addressOffset>0xcbc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xfff</resetMask>
          <fields>
            <field>
              <name>LEB</name>
              <description>LEB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXCON5</name>
          <displayName>AUXCON5</displayName>
          <description>AUXCON5</description>
          <addressOffset>0xcbe</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf3f</resetMask>
          <fields>
            <field>
              <name>CHOPLEN</name>
              <description>CHOPLEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWMCON6</name>
          <displayName>PWMCON6</displayName>
          <description>PWMCON6</description>
          <addressOffset>0xcc0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffef</resetMask>
          <fields>
            <field>
              <name>IUE</name>
              <description>IUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
