xsession/openocd/svd/microchip/dspic33ep128gm604.svd
        <register>
          <name>IOCON6</name>
          <displayName>IOCON6</displayName>
          <description>IOCON6</description>
          <addressOffset>0xcc2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>OSYNC</name>
              <description>OSYNC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FCLCON6</name>
          <displayName>FCLCON6</displayName>
          <description>FCLCON6</description>
          <addressOffset>0xcc4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>FLTMOD</name>
              <description>FLTMOD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PDC6</name>
          <displayName>PDC6</displayName>
          <description>PDC6</description>
          <addressOffset>0xcc6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PDC6</name>
              <description>PDC6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PHASE6</name>
          <displayName>PHASE6</displayName>
          <description>PHASE6</description>
          <addressOffset>0xcc8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PHASE6</name>
              <description>PHASE6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DTR6</name>
          <displayName>DTR6</displayName>
          <description>DTR6</description>
          <addressOffset>0xcca</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3fff</resetMask>
          <fields>
            <field>
              <name>DTR6</name>
              <description>DTR6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ALTDTR6</name>
          <displayName>ALTDTR6</displayName>
          <description>ALTDTR6</description>
          <addressOffset>0xccc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3fff</resetMask>
          <fields>
            <field>
              <name>ALTDTR6</name>
              <description>ALTDTR6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDC6</name>
          <displayName>SDC6</displayName>
          <description>SDC6</description>
          <addressOffset>0xcce</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SDC6</name>
              <description>SDC6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPHASE6</name>
          <displayName>SPHASE6</displayName>
          <description>SPHASE6</description>
          <addressOffset>0xcd0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SPHASE6</name>
              <description>SPHASE6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIG6</name>
          <displayName>TRIG6</displayName>
          <description>TRIG6</description>
          <addressOffset>0xcd2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TRGCMP</name>
              <description>TRGCMP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGCON6</name>
          <displayName>TRGCON6</displayName>
          <description>TRGCON6</description>
          <addressOffset>0xcd4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf03f</resetMask>
          <fields>
            <field>
              <name>TRGSTRT</name>
              <description>TRGSTRT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWMCAP6</name>
          <displayName>PWMCAP6</displayName>
          <description>PWMCAP6</description>
          <addressOffset>0xcd8</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PWMCAP</name>
              <description>PWMCAP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LEBCON6</name>
          <displayName>LEBCON6</displayName>
          <description>LEBCON6</description>
          <addressOffset>0xcda</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xfc3f</resetMask>
          <fields>
            <field>
              <name>BPLL</name>
              <description>BPLL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LEBDLY6</name>
          <displayName>LEBDLY6</displayName>
          <description>LEBDLY6</description>
          <addressOffset>0xcdc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xfff</resetMask>
          <fields>
            <field>
              <name>LEB</name>
              <description>LEB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXCON6</name>
          <displayName>AUXCON6</displayName>
          <description>AUXCON6</description>
          <addressOffset>0xcde</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf3f</resetMask>
          <fields>
            <field>
              <name>CHOPLEN</name>
              <description>CHOPLEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISA</name>
          <displayName>TRISA</displayName>
          <description>TRISA</description>
          <addressOffset>0xe00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x79f</resetValue>
          <resetMask>0x79f</resetMask>
          <fields>
            <field>
              <name>TRISA0</name>
              <description>TRISA0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTA</name>
          <displayName>PORTA</displayName>
          <description>PORTA</description>
          <addressOffset>0xe02</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RA0</name>
              <description>RA0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LATA</name>
          <displayName>LATA</displayName>
          <description>LATA</description>
          <addressOffset>0xe04</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x79f</resetMask>
          <fields>
            <field>
              <name>LATA0</name>
              <description>LATA0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCA</name>
          <displayName>ODCA</displayName>
          <description>ODCA</description>
          <addressOffset>0xe06</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x79f</resetMask>
          <fields>
            <field>
              <name>ODCA0</name>
              <description>ODCA0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENA</name>
          <displayName>CNENA</displayName>
          <description>CNENA</description>
          <addressOffset>0xe08</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x79f</resetMask>
          <fields>
            <field>
              <name>CNIEA0</name>
              <description>CNIEA0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUA</name>
          <displayName>CNPUA</displayName>
          <description>CNPUA</description>
          <addressOffset>0xe0a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x79f</resetMask>
          <fields>
            <field>
              <name>CNPUA0</name>
              <description>CNPUA0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDA</name>
          <displayName>CNPDA</displayName>
          <description>CNPDA</description>
          <addressOffset>0xe0c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x79f</resetMask>
          <fields>
            <field>
              <name>CNPDA0</name>
              <description>CNPDA0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELA</name>
          <displayName>ANSELA</displayName>
          <description>ANSELA</description>
          <addressOffset>0xe0e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x21f</resetValue>
          <resetMask>0x21f</resetMask>
          <fields>
            <field>
              <name>ANSA0</name>
              <description>ANSA0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISB</name>
          <displayName>TRISB</displayName>
          <description>TRISB</description>
          <addressOffset>0xe10</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xffff</resetValue>
          <resetMask>0xffff</resetMask>
          <fields>
            <field>
              <name>TRISB0</name>
              <description>TRISB0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTB</name>
          <displayName>PORTB</displayName>
          <description>PORTB</description>
          <addressOffset>0xe12</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RB0</name>
              <description>RB0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LATB</name>
          <displayName>LATB</displayName>
          <description>LATB</description>
          <addressOffset>0xe14</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>LATB0</name>
              <description>LATB0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCB</name>
          <displayName>ODCB</displayName>
          <description>ODCB</description>
          <addressOffset>0xe16</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>ODCB0</name>
              <description>ODCB0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENB</name>
          <displayName>CNENB</displayName>
          <description>CNENB</description>
          <addressOffset>0xe18</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>CNIEB0</name>
              <description>CNIEB0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUB</name>
          <displayName>CNPUB</displayName>
          <description>CNPUB</description>
          <addressOffset>0xe1a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>CNPUB0</name>
              <description>CNPUB0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDB</name>
          <displayName>CNPDB</displayName>
          <description>CNPDB</description>
          <addressOffset>0xe1c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>CNPDB0</name>
              <description>CNPDB0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELB</name>
          <displayName>ANSELB</displayName>
          <description>ANSELB</description>
          <addressOffset>0xe1e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x38f</resetValue>
          <resetMask>0x38f</resetMask>
          <fields>
            <field>
              <name>ANSB0</name>
              <description>ANSB0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISC</name>
          <displayName>TRISC</displayName>
          <description>TRISC</description>
          <addressOffset>0xe20</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x3ff</resetValue>
          <resetMask>0x3ff</resetMask>
          <fields>
            <field>
              <name>TRISC0</name>
              <description>TRISC0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTC</name>
          <displayName>PORTC</displayName>
          <description>PORTC</description>
          <addressOffset>0xe22</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RC0</name>
              <description>RC0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LATC</name>
          <displayName>LATC</displayName>
          <description>LATC</description>
          <addressOffset>0xe24</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3ff</resetMask>
          <fields>
            <field>
              <name>LATC0</name>
              <description>LATC0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCC</name>
          <displayName>ODCC</displayName>
          <description>ODCC</description>
          <addressOffset>0xe26</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3ff</resetMask>
          <fields>
            <field>
              <name>ODCC0</name>
              <description>ODCC0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENC</name>
          <displayName>CNENC</displayName>
          <description>CNENC</description>
          <addressOffset>0xe28</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3ff</resetMask>
          <fields>
            <field>
              <name>CNIEC0</name>
              <description>CNIEC0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUC</name>
          <displayName>CNPUC</displayName>
          <description>CNPUC</description>
          <addressOffset>0xe2a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3ff</resetMask>
          <fields>
            <field>
              <name>CNPUC0</name>
              <description>CNPUC0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDC</name>
          <displayName>CNPDC</displayName>
          <description>CNPDC</description>
          <addressOffset>0xe2c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3ff</resetMask>
          <fields>
            <field>
              <name>CNPDC0</name>
              <description>CNPDC0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELC</name>
          <displayName>ANSELC</displayName>
          <description>ANSELC</description>
          <addressOffset>0xe2e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x3f</resetValue>
          <resetMask>0x3f</resetMask>
          <fields>
            <field>
              <name>ANSC0</name>
              <description>ANSC0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PADCFG1</name>
          <displayName>PADCFG1</displayName>
          <description>PADCFG1</description>
          <addressOffset>0xefe</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>PMPTTL</name>
              <description>PMPTTL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FEXL</name>
          <displayName>FEXL</displayName>
          <description>FEXL</description>
          <addressOffset>0xf80</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>FEXL</name>
              <description>FEXL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FEXU</name>
          <displayName>FEXU</displayName>
          <description>FEXU</description>
          <addressOffset>0xf82</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>FEXU</name>
              <description>FEXU</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
