xsession/openocd/svd/microchip/dspic33ep128gm604.svd
        <register>
          <name>VISI</name>
          <displayName>VISI</displayName>
          <description>VISI</description>
          <addressOffset>0xf88</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>VISI</name>
              <description>VISI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DPCL</name>
          <displayName>DPCL</displayName>
          <description>DPCL</description>
          <addressOffset>0xf8a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>DPCL</name>
              <description>DPCL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DPCU</name>
          <displayName>DPCU</displayName>
          <description>DPCU</description>
          <addressOffset>0xf8c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>DPCU</name>
              <description>DPCU</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APPO</name>
          <displayName>APPO</displayName>
          <description>APPO</description>
          <addressOffset>0xfa0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>APPO</name>
              <description>APPO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APPIN</name>
          <displayName>APPIN</displayName>
          <description>APPIN</description>
          <addressOffset>0xfa2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>APPIN</name>
              <description>APPIN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APPS</name>
          <displayName>APPS</displayName>
          <description>APPS</description>
          <addressOffset>0xfa4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>APIFUL</name>
              <description>APIFUL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STROUTL</name>
          <displayName>STROUTL</displayName>
          <description>STROUTL</description>
          <addressOffset>0xfa6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>STROUTL</name>
              <description>STROUTL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STROUTH</name>
          <displayName>STROUTH</displayName>
          <description>STROUTH</description>
          <addressOffset>0xfa8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>STROUTH</name>
              <description>STROUTH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STROVCNT</name>
          <displayName>STROVCNT</displayName>
          <description>STROVCNT</description>
          <addressOffset>0xfaa</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>STROVCNT</name>
              <description>STROVCNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFTADD</name>
          <displayName>DFTADD</displayName>
          <description>DFTADD</description>
          <addressOffset>0xfc6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>DFTADD</name>
              <description>DFTADD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFTDATA</name>
          <displayName>DFTDATA</displayName>
          <description>DFTDATA</description>
          <addressOffset>0xfc8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>DFTDATA</name>
              <description>DFTDATA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFTDATA_INC</name>
          <displayName>DFTDATA_INC</displayName>
          <description>DFTDATA_INC</description>
          <addressOffset>0xfca</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>DFTDATA_INC</name>
              <description>DFTDATA_INC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JDATAH</name>
          <displayName>JDATAH</displayName>
          <description>JDATAH</description>
          <addressOffset>0xff0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>JDATAH</name>
              <description>JDATAH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JDATAL</name>
          <displayName>JDATAL</displayName>
          <description>JDATAL</description>
          <addressOffset>0xff2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>JDATAL</name>
              <description>JDATAL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>